; ModuleID = 'DragUnder.c'
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct._WidgetRec = type { %struct._CorePart }
%struct._CorePart = type { %struct._WidgetRec*, %struct._WidgetClassRec*, %struct._WidgetRec*, i32, i8, %struct._XtCallbackRec*, i8*, i16, i16, i16, i16, i16, i8, i8, i8, %struct._XtEventRec*, %struct._XtTMRec, %struct._TranslationData*, i64, i64, %struct._WidgetRec**, i32, i8*, %struct.Screen*, i64, i64, i32, i64, i64, i8, i8 }
%struct._WidgetClassRec = type { %struct._CoreClassPart }

!57 = !DIEnumerator(name: "XmSASH_BIT", value: 39)
!58 = !DIEnumerator(name: "XmSCALE_BIT", value: 40)
!59 = !DIEnumerator(name: "XmPANED_WINDOW_BIT", value: 41)
!60 = !DIEnumerator(name: "XmVENDOR_SHELL_BIT", value: 42)
!61 = !DIEnumerator(name: "XmCLIP_WINDOW_BIT", value: 43)
!62 = !DIEnumerator(name: "XmDRAG_ICON_BIT", value: 44)
!63 = !DIEnumerator(name: "XmTEAROFF_BUTTON_BIT", value: 45)
!64 = !DIEnumerator(name: "XmDRAG_OVER_SHELL_BIT", value: 46)
!65 = !DIEnumerator(name: "XmDRAG_CONTEXT_BIT", value: 47)
!66 = !DIEnumerator(name: "XmCONTAINER_BIT", value: 48)
!67 = !DIEnumerator(name: "XmICONGADGET_BIT", value: 49)
!68 = !DIEnumerator(name: "XmNOTEBOOK_BIT", value: 50)
!69 = !DIEnumerator(name: "XmCSTEXT_BIT", value: 51)
!70 = !DIEnumerator(name: "XmGRAB_SHELL_BIT", value: 52)
!71 = !DIEnumerator(name: "XmCOMBO_BOX_BIT", value: 53)
!72 = !DIEnumerator(name: "XmSPINBOX_BIT", value: 54)
!73 = !DIEnumerator(name: "XmICONHEADER_BIT", value: 55)
!74 = !DIEnumerator(name: "XmBUTTONBOX_BIT", value: 56)
!75 = !DIEnumerator(name: "XmDATAFIELD_BIT", value: 57)
!76 = !DIEnumerator(name: "XmI18LIST_BIT", value: 58)
!77 = !DIEnumerator(name: "XmEXT18LIST_BIT", value: 59)
!78 = !DIEnumerator(name: "XmMULTI_LIST_BIT", value: 59)
!79 = !DIEnumerator(name: "XmCOLORSELECTOR_BIT", value: 60)
!80 = !DIEnumerator(name: "XmICONBOX_BIT", value: 61)
!81 = !DIEnumerator(name: "XmICONBUTTON_BIT", value: 62)
!82 = !DIEnumerator(name: "XmTABLE_BIT", value: 63)
!83 = !DIEnumerator(name: "XmTABSTACK_BIT", value: 64)
!84 = !DIEnumerator(name: "XmTREE_BIT", value: 65)
!85 = !DIEnumerator(name: "XmTABBOX_BIT", value: 66)
!86 = !DIEnumerator(name: "XmCOLUMN_BIT", value: 67)
!87 = !DIEnumerator(name: "XmFONTSELECTOR_BIT", value: 68)
!88 = !DIEnumerator(name: "XmCOMBINATION_BOX_2_BIT", value: 69)
!89 = !DIEnumerator(name: "XmDROP_DOWN_BIT", value: 69)
!90 = !DIEnumerator(name: "XmFAST_SUBCLASS_TAIL_BIT", value: 70)
!91 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !11, line: 863, size: 32, align: 32, elements: !92)
!92 = !{!93, !94}
!93 = !DIEnumerator(name: "XmSHADOW_IN", value: 7)
!94 = !DIEnumerator(name: "XmSHADOW_OUT", value: 8)
!95 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !96, line: 61, size: 32, align: 32, elements: !97)
!96 = !DIFile(filename: "../Xm/DropSMgr.h", directory: "/home/dph/xpdf/motif-2.3.4/lib/Xm")
!97 = !{!98, !99, !100, !101, !102}
!98 = !DIEnumerator(name: "XmDRAG_UNDER_NONE", value: 0)
!99 = !DIEnumerator(name: "XmDRAG_UNDER_PIXMAP", value: 1)
!100 = !DIEnumerator(name: "XmDRAG_UNDER_SHADOW_IN", value: 2)
!101 = !DIEnumerator(name: "XmDRAG_UNDER_SHADOW_OUT", value: 3)
!102 = !DIEnumerator(name: "XmDRAG_UNDER_HIGHLIGHT", value: 4)
!103 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !96, line: 65, size: 32, align: 32, elements: !104)
!104 = !{!105, !106, !107, !108}
!105 = !DIEnumerator(name: "XmDROP_SITE_SIMPLE", value: 0)
!106 = !DIEnumerator(name: "XmDROP_SITE_COMPOSITE", value: 1)
!107 = !DIEnumerator(name: "XmDROP_SITE_SIMPLE_CLIP_ONLY", value: 128)
!108 = !DIEnumerator(name: "XmDROP_SITE_COMPOSITE_CLIP_ONLY", value: 129)
!109 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !4, line: 353, size: 32, align: 32, elements: !110)
!110 = !{!111, !112, !113}
!111 = !DIEnumerator(name: "XtGrabNone", value: 0)
!112 = !DIEnumerator(name: "XtGrabNonexclusive", value: 1)
!113 = !DIEnumerator(name: "XtGrabExclusive", value: 2)
!114 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !4, line: 298, size: 32, align: 32, elements: !115)
!115 = !{!116, !117}
!116 = !DIEnumerator(name: "XtListHead", value: 0)
!117 = !DIEnumerator(name: "XtListTail", value: 1)
!118 = !{!119, !975, !989, !1002, !1212, !1213, !1219, !714, !695, !130, !1200, !155, !152, !1224, !1238, !1432, !1434, !1436, !1009, !182}
!119 = !DIDerivedType(tag: DW_TAG_typedef, name: "XmDropSiteManagerObject", file: !96, line: 118, baseType: !120)
!120 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !121, size: 64, align: 64)
!121 = !DICompositeType(tag: DW_TAG_structure_type, name: "_XmDropSiteManagerRec", file: !122, line: 269, size: 1536, align: 64, elements: !123)
!122 = !DIFile(filename: "../Xm/DropSMgrP.h", directory: "/home/dph/xpdf/motif-2.3.4/lib/Xm")
!123 = !{!124, !921}
!124 = !DIDerivedType(tag: DW_TAG_member, name: "object", scope: !121, file: !122, line: 270, baseType: !125, size: 384, align: 64)
!125 = !DIDerivedType(tag: DW_TAG_typedef, name: "ObjectPart", file: !126, line: 69, baseType: !127)
!126 = !DIFile(filename: "/usr/include/X11/ObjectP.h", directory: "/home/dph/xpdf/motif-2.3.4/lib/Xm")
!127 = !DICompositeType(tag: DW_TAG_structure_type, name: "_ObjectPart", file: !126, line: 61, size: 384, align: 64, elements: !128)
!128 = !{!129, !915, !916, !917, !918, !919, !920}
!129 = !DIDerivedType(tag: DW_TAG_member, name: "self", scope: !127, file: !126, line: 62, baseType: !130, size: 64, align: 64)
!130 = !DIDerivedType(tag: DW_TAG_typedef, name: "Widget", file: !4, line: 107, baseType: !131)
!131 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !132, size: 64, align: 64)
!132 = !DICompositeType(tag: DW_TAG_structure_type, name: "_WidgetRec", file: !133, line: 104, size: 1664, align: 64, elements: !134)
!133 = !DIFile(filename: "/usr/include/X11/CoreP.h", directory: "/home/dph/xpdf/motif-2.3.4/lib/Xm")
!134 = !{!135}
!135 = !DIDerivedType(tag: DW_TAG_member, name: "core", scope: !132, file: !133, line: 105, baseType: !136, size: 1664, align: 64)
!136 = !DIDerivedType(tag: DW_TAG_typedef, name: "CorePart", file: !133, line: 102, baseType: !137)
!137 = !DICompositeType(tag: DW_TAG_structure_type, name: "_CorePart", file: !133, line: 72, size: 1664, align: 64, elements: !138)
!138 = !{!139, !140, !794, !795, !797, !798, !809, !810, !811, !812, !813, !814, !815, !816, !817, !818, !822, !837, !838, !840, !841, !844, !845, !846, !908, !909, !910, !911, !912, !913, !914}
!139 = !DIDerivedType(tag: DW_TAG_member, name: "self", scope: !137, file: !133, line: 73, baseType: !130, size: 64, align: 64)
!140 = !DIDerivedType(tag: DW_TAG_member, name: "widget_class", scope: !137, file: !133, line: 74, baseType: !141, size: 64, align: 64, offset: 64)
!141 = !DIDerivedType(tag: DW_TAG_typedef, name: "WidgetClass", file: !4, line: 109, baseType: !142)
!142 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !143, size: 64, align: 64)
!143 = !DICompositeType(tag: DW_TAG_structure_type, name: "_WidgetClassRec", file: !133, line: 160, size: 1792, align: 64, elements: !144)
!144 = !{!145}
!145 = !DIDerivedType(tag: DW_TAG_member, name: "core_class", scope: !143, file: !133, line: 161, baseType: !146, size: 1792, align: 64)
!146 = !DIDerivedType(tag: DW_TAG_typedef, name: "CoreClassPart", file: !133, line: 158, baseType: !147)
!147 = !DICompositeType(tag: DW_TAG_structure_type, name: "_CoreClassPart", file: !133, line: 125, size: 1792, align: 64, elements: !148)
!148 = !{!149, !150, !154, !157, !163, !168, !171, !185, !190, !224, !701, !702, !715, !716, !720, !722, !723, !724, !725, !730, !731, !740, !745, !750, !771, !772, !778, !780, !781, !782, !788, !793}
!149 = !DIDerivedType(tag: DW_TAG_member, name: "superclass", scope: !147, file: !133, line: 126, baseType: !141, size: 64, align: 64)
!150 = !DIDerivedType(tag: DW_TAG_member, name: "class_name", scope: !147, file: !133, line: 127, baseType: !151, size: 64, align: 64, offset: 64)
!151 = !DIDerivedType(tag: DW_TAG_typedef, name: "String", file: !4, line: 66, baseType: !152)
!152 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !153, size: 64, align: 64)
!153 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!154 = !DIDerivedType(tag: DW_TAG_member, name: "widget_size", scope: !147, file: !133, line: 128, baseType: !155, size: 32, align: 32, offset: 128)
!155 = !DIDerivedType(tag: DW_TAG_typedef, name: "Cardinal", file: !4, line: 160, baseType: !156)
!156 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!157 = !DIDerivedType(tag: DW_TAG_member, name: "class_initialize", scope: !147, file: !133, line: 129, baseType: !158, size: 64, align: 64, offset: 192)
!158 = !DIDerivedType(tag: DW_TAG_typedef, name: "XtProc", file: !159, line: 77, baseType: !160)
!159 = !DIFile(filename: "/usr/include/X11/IntrinsicP.h", directory: "/home/dph/xpdf/motif-2.3.4/lib/Xm")
!160 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !161, size: 64, align: 64)
!161 = !DISubroutineType(types: !162)
!162 = !{null}
!163 = !DIDerivedType(tag: DW_TAG_member, name: "class_part_initialize", scope: !147, file: !133, line: 130, baseType: !164, size: 64, align: 64, offset: 256)
!164 = !DIDerivedType(tag: DW_TAG_typedef, name: "XtWidgetClassProc", file: !159, line: 81, baseType: !165)
!165 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !166, size: 64, align: 64)
!166 = !DISubroutineType(types: !167)
!167 = !{null, !141}
!168 = !DIDerivedType(tag: DW_TAG_member, name: "class_inited", scope: !147, file: !133, line: 131, baseType: !169, size: 8, align: 8, offset: 320)
!169 = !DIDerivedType(tag: DW_TAG_typedef, name: "XtEnum", file: !4, line: 157, baseType: !170)
!170 = !DIBasicType(name: "unsigned char", size: 8, align: 8, encoding: DW_ATE_unsigned_char)
!171 = !DIDerivedType(tag: DW_TAG_member, name: "initialize", scope: !147, file: !133, line: 132, baseType: !172, size: 64, align: 64, offset: 384)
!172 = !DIDerivedType(tag: DW_TAG_typedef, name: "XtInitProc", file: !159, line: 100, baseType: !173)
!173 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !174, size: 64, align: 64)
!174 = !DISubroutineType(types: !175)
!175 = !{null, !130, !130, !176, !184}
!176 = !DIDerivedType(tag: DW_TAG_typedef, name: "ArgList", file: !4, line: 325, baseType: !177)
!177 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !178, size: 64, align: 64)
!178 = !DICompositeType(tag: DW_TAG_structure_type, file: !4, line: 322, size: 128, align: 64, elements: !179)
!179 = !{!180, !181}
!180 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !178, file: !4, line: 323, baseType: !151, size: 64, align: 64)
!181 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !178, file: !4, line: 324, baseType: !182, size: 64, align: 64, offset: 64)
!182 = !DIDerivedType(tag: DW_TAG_typedef, name: "XtArgVal", file: !4, line: 156, baseType: !183)
!183 = !DIBasicType(name: "long int", size: 64, align: 64, encoding: DW_ATE_signed)
!184 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !155, size: 64, align: 64)
!185 = !DIDerivedType(tag: DW_TAG_member, name: "initialize_hook", scope: !147, file: !133, line: 133, baseType: !186, size: 64, align: 64, offset: 448)
!186 = !DIDerivedType(tag: DW_TAG_typedef, name: "XtArgsProc", file: !159, line: 94, baseType: !187)
!187 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !188, size: 64, align: 64)
!188 = !DISubroutineType(types: !189)
!189 = !{null, !130, !176, !184}
!190 = !DIDerivedType(tag: DW_TAG_member, name: "realize", scope: !147, file: !133, line: 134, baseType: !191, size: 64, align: 64, offset: 512)
!191 = !DIDerivedType(tag: DW_TAG_typedef, name: "XtRealizeProc", file: !159, line: 146, baseType: !192)
!192 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !193, size: 64, align: 64)
!193 = !DISubroutineType(types: !194)
!194 = !{null, !130, !195, !198}
!195 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !196, size: 64, align: 64)
!196 = !DIDerivedType(tag: DW_TAG_typedef, name: "XtValueMask", file: !4, line: 115, baseType: !197)
!197 = !DIBasicType(name: "long unsigned int", size: 64, align: 64, encoding: DW_ATE_unsigned)
!198 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !199, size: 64, align: 64)
!199 = !DIDerivedType(tag: DW_TAG_typedef, name: "XSetWindowAttributes", file: !200, line: 318, baseType: !201)
!200 = !DIFile(filename: "/usr/include/X11/Xlib.h", directory: "/home/dph/xpdf/motif-2.3.4/lib/Xm")
!201 = !DICompositeType(tag: DW_TAG_structure_type, file: !200, line: 302, size: 896, align: 64, elements: !202)
!202 = !{!203, !207, !208, !209, !210, !212, !213, !214, !215, !216, !217, !218, !219, !220, !222}
!203 = !DIDerivedType(tag: DW_TAG_member, name: "background_pixmap", scope: !201, file: !200, line: 303, baseType: !204, size: 64, align: 64)
!204 = !DIDerivedType(tag: DW_TAG_typedef, name: "Pixmap", file: !205, line: 102, baseType: !206)
!205 = !DIFile(filename: "/usr/include/X11/X.h", directory: "/home/dph/xpdf/motif-2.3.4/lib/Xm")
!206 = !DIDerivedType(tag: DW_TAG_typedef, name: "XID", file: !205, line: 66, baseType: !197)
!207 = !DIDerivedType(tag: DW_TAG_member, name: "background_pixel", scope: !201, file: !200, line: 304, baseType: !197, size: 64, align: 64, offset: 64)
!208 = !DIDerivedType(tag: DW_TAG_member, name: "border_pixmap", scope: !201, file: !200, line: 305, baseType: !204, size: 64, align: 64, offset: 128)
!209 = !DIDerivedType(tag: DW_TAG_member, name: "border_pixel", scope: !201, file: !200, line: 306, baseType: !197, size: 64, align: 64, offset: 192)
!210 = !DIDerivedType(tag: DW_TAG_member, name: "bit_gravity", scope: !201, file: !200, line: 307, baseType: !211, size: 32, align: 32, offset: 256)
!211 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!212 = !DIDerivedType(tag: DW_TAG_member, name: "win_gravity", scope: !201, file: !200, line: 308, baseType: !211, size: 32, align: 32, offset: 288)
!213 = !DIDerivedType(tag: DW_TAG_member, name: "backing_store", scope: !201, file: !200, line: 309, baseType: !211, size: 32, align: 32, offset: 320)
!214 = !DIDerivedType(tag: DW_TAG_member, name: "backing_planes", scope: !201, file: !200, line: 310, baseType: !197, size: 64, align: 64, offset: 384)
!215 = !DIDerivedType(tag: DW_TAG_member, name: "backing_pixel", scope: !201, file: !200, line: 311, baseType: !197, size: 64, align: 64, offset: 448)
!216 = !DIDerivedType(tag: DW_TAG_member, name: "save_under", scope: !201, file: !200, line: 312, baseType: !211, size: 32, align: 32, offset: 512)
!217 = !DIDerivedType(tag: DW_TAG_member, name: "event_mask", scope: !201, file: !200, line: 313, baseType: !183, size: 64, align: 64, offset: 576)
!218 = !DIDerivedType(tag: DW_TAG_member, name: "do_not_propagate_mask", scope: !201, file: !200, line: 314, baseType: !183, size: 64, align: 64, offset: 640)
!219 = !DIDerivedType(tag: DW_TAG_member, name: "override_redirect", scope: !201, file: !200, line: 315, baseType: !211, size: 32, align: 32, offset: 704)
!220 = !DIDerivedType(tag: DW_TAG_member, name: "colormap", scope: !201, file: !200, line: 316, baseType: !221, size: 64, align: 64, offset: 768)
!221 = !DIDerivedType(tag: DW_TAG_typedef, name: "Colormap", file: !205, line: 104, baseType: !206)
!222 = !DIDerivedType(tag: DW_TAG_member, name: "cursor", scope: !201, file: !200, line: 317, baseType: !223, size: 64, align: 64, offset: 832)
!223 = !DIDerivedType(tag: DW_TAG_typedef, name: "Cursor", file: !205, line: 103, baseType: !206)
!224 = !DIDerivedType(tag: DW_TAG_member, name: "actions", scope: !147, file: !133, line: 135, baseType: !225, size: 64, align: 64, offset: 576)
!225 = !DIDerivedType(tag: DW_TAG_typedef, name: "XtActionList", file: !4, line: 111, baseType: !226)
!226 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !227, size: 64, align: 64)
!227 = !DICompositeType(tag: DW_TAG_structure_type, name: "_XtActionsRec", file: !4, line: 189, size: 128, align: 64, elements: !228)
!228 = !{!229, !230}
!229 = !DIDerivedType(tag: DW_TAG_member, name: "string", scope: !227, file: !4, line: 190, baseType: !151, size: 64, align: 64)
!230 = !DIDerivedType(tag: DW_TAG_member, name: "proc", scope: !227, file: !4, line: 191, baseType: !231, size: 64, align: 64, offset: 64)
!231 = !DIDerivedType(tag: DW_TAG_typedef, name: "XtActionProc", file: !4, line: 180, baseType: !232)
!232 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !233, size: 64, align: 64)
!233 = !DISubroutineType(types: !234)
!234 = !{null, !130, !235, !700, !184}
!235 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !236, size: 64, align: 64)
!236 = !DIDerivedType(tag: DW_TAG_typedef, name: "XEvent", file: !200, line: 1021, baseType: !237)
!237 = !DICompositeType(tag: DW_TAG_union_type, name: "_XEvent", file: !200, line: 985, size: 1536, align: 64, elements: !238)
!238 = !{!239, !240, !253, !273, !292, !311, !332, !343, !357, !374, !385, !395, !411, !421, !432, !443, !453, !467, !484, !496, !507, !525, !536, !547, !560, !571, !585, !598, !610, !637, !649, !660, !673, !683, !696}
!239 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !237, file: !200, line: 986, baseType: !211, size: 32, align: 32)
!240 = !DIDerivedType(tag: DW_TAG_member, name: "xany", scope: !237, file: !200, line: 987, baseType: !241, size: 320, align: 64)
!241 = !DIDerivedType(tag: DW_TAG_typedef, name: "XAnyEvent", file: !200, line: 952, baseType: !242)
!242 = !DICompositeType(tag: DW_TAG_structure_type, file: !200, line: 946, size: 320, align: 64, elements: !243)
!243 = !{!244, !245, !246, !247, !251}
!244 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !242, file: !200, line: 947, baseType: !211, size: 32, align: 32)
!245 = !DIDerivedType(tag: DW_TAG_member, name: "serial", scope: !242, file: !200, line: 948, baseType: !197, size: 64, align: 64, offset: 64)
!246 = !DIDerivedType(tag: DW_TAG_member, name: "send_event", scope: !242, file: !200, line: 949, baseType: !211, size: 32, align: 32, offset: 128)
!247 = !DIDerivedType(tag: DW_TAG_member, name: "display", scope: !242, file: !200, line: 950, baseType: !248, size: 64, align: 64, offset: 192)
!248 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !249, size: 64, align: 64)
!249 = !DIDerivedType(tag: DW_TAG_typedef, name: "Display", file: !200, line: 499, baseType: !250)
!250 = !DICompositeType(tag: DW_TAG_structure_type, name: "_XDisplay", file: !200, line: 267, flags: DIFlagFwdDecl)
!251 = !DIDerivedType(tag: DW_TAG_member, name: "window", scope: !242, file: !200, line: 951, baseType: !252, size: 64, align: 64, offset: 256)
!252 = !DIDerivedType(tag: DW_TAG_typedef, name: "Window", file: !205, line: 96, baseType: !206)
!253 = !DIDerivedType(tag: DW_TAG_member, name: "xkey", scope: !237, file: !200, line: 988, baseType: !254, size: 768, align: 64)
!254 = !DIDerivedType(tag: DW_TAG_typedef, name: "XKeyEvent", file: !200, line: 583, baseType: !255)
!255 = !DICompositeType(tag: DW_TAG_structure_type, file: !200, line: 569, size: 768, align: 64, elements: !256)
!256 = !{!257, !258, !259, !260, !261, !262, !263, !264, !266, !267, !268, !269, !270, !271, !272}
!257 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !255, file: !200, line: 570, baseType: !211, size: 32, align: 32)
!258 = !DIDerivedType(tag: DW_TAG_member, name: "serial", scope: !255, file: !200, line: 571, baseType: !197, size: 64, align: 64, offset: 64)
!259 = !DIDerivedType(tag: DW_TAG_member, name: "send_event", scope: !255, file: !200, line: 572, baseType: !211, size: 32, align: 32, offset: 128)
!260 = !DIDerivedType(tag: DW_TAG_member, name: "display", scope: !255, file: !200, line: 573, baseType: !248, size: 64, align: 64, offset: 192)
!261 = !DIDerivedType(tag: DW_TAG_member, name: "window", scope: !255, file: !200, line: 574, baseType: !252, size: 64, align: 64, offset: 256)
!262 = !DIDerivedType(tag: DW_TAG_member, name: "root", scope: !255, file: !200, line: 575, baseType: !252, size: 64, align: 64, offset: 320)
!263 = !DIDerivedType(tag: DW_TAG_member, name: "subwindow", scope: !255, file: !200, line: 576, baseType: !252, size: 64, align: 64, offset: 384)
!264 = !DIDerivedType(tag: DW_TAG_member, name: "time", scope: !255, file: !200, line: 577, baseType: !265, size: 64, align: 64, offset: 448)
!265 = !DIDerivedType(tag: DW_TAG_typedef, name: "Time", file: !205, line: 77, baseType: !197)
!266 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !255, file: !200, line: 578, baseType: !211, size: 32, align: 32, offset: 512)
!267 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !255, file: !200, line: 578, baseType: !211, size: 32, align: 32, offset: 544)
!268 = !DIDerivedType(tag: DW_TAG_member, name: "x_root", scope: !255, file: !200, line: 579, baseType: !211, size: 32, align: 32, offset: 576)
!269 = !DIDerivedType(tag: DW_TAG_member, name: "y_root", scope: !255, file: !200, line: 579, baseType: !211, size: 32, align: 32, offset: 608)
!270 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !255, file: !200, line: 580, baseType: !156, size: 32, align: 32, offset: 640)
!271 = !DIDerivedType(tag: DW_TAG_member, name: "keycode", scope: !255, file: !200, line: 581, baseType: !156, size: 32, align: 32, offset: 672)
!272 = !DIDerivedType(tag: DW_TAG_member, name: "same_screen", scope: !255, file: !200, line: 582, baseType: !211, size: 32, align: 32, offset: 704)
!273 = !DIDerivedType(tag: DW_TAG_member, name: "xbutton", scope: !237, file: !200, line: 989, baseType: !274, size: 768, align: 64)
!274 = !DIDerivedType(tag: DW_TAG_typedef, name: "XButtonEvent", file: !200, line: 601, baseType: !275)
!275 = !DICompositeType(tag: DW_TAG_structure_type, file: !200, line: 587, size: 768, align: 64, elements: !276)
!276 = !{!277, !278, !279, !280, !281, !282, !283, !284, !285, !286, !287, !288, !289, !290, !291}
!277 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !275, file: !200, line: 588, baseType: !211, size: 32, align: 32)
!278 = !DIDerivedType(tag: DW_TAG_member, name: "serial", scope: !275, file: !200, line: 589, baseType: !197, size: 64, align: 64, offset: 64)
!279 = !DIDerivedType(tag: DW_TAG_member, name: "send_event", scope: !275, file: !200, line: 590, baseType: !211, size: 32, align: 32, offset: 128)
!280 = !DIDerivedType(tag: DW_TAG_member, name: "display", scope: !275, file: !200, line: 591, baseType: !248, size: 64, align: 64, offset: 192)
!281 = !DIDerivedType(tag: DW_TAG_member, name: "window", scope: !275, file: !200, line: 592, baseType: !252, size: 64, align: 64, offset: 256)
!282 = !DIDerivedType(tag: DW_TAG_member, name: "root", scope: !275, file: !200, line: 593, baseType: !252, size: 64, align: 64, offset: 320)
!283 = !DIDerivedType(tag: DW_TAG_member, name: "subwindow", scope: !275, file: !200, line: 594, baseType: !252, size: 64, align: 64, offset: 384)
!284 = !DIDerivedType(tag: DW_TAG_member, name: "time", scope: !275, file: !200, line: 595, baseType: !265, size: 64, align: 64, offset: 448)
!285 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !275, file: !200, line: 596, baseType: !211, size: 32, align: 32, offset: 512)
!286 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !275, file: !200, line: 596, baseType: !211, size: 32, align: 32, offset: 544)
!287 = !DIDerivedType(tag: DW_TAG_member, name: "x_root", scope: !275, file: !200, line: 597, baseType: !211, size: 32, align: 32, offset: 576)
!288 = !DIDerivedType(tag: DW_TAG_member, name: "y_root", scope: !275, file: !200, line: 597, baseType: !211, size: 32, align: 32, offset: 608)
!289 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !275, file: !200, line: 598, baseType: !156, size: 32, align: 32, offset: 640)
!290 = !DIDerivedType(tag: DW_TAG_member, name: "button", scope: !275, file: !200, line: 599, baseType: !156, size: 32, align: 32, offset: 672)
!291 = !DIDerivedType(tag: DW_TAG_member, name: "same_screen", scope: !275, file: !200, line: 600, baseType: !211, size: 32, align: 32, offset: 704)
!292 = !DIDerivedType(tag: DW_TAG_member, name: "xmotion", scope: !237, file: !200, line: 990, baseType: !293, size: 768, align: 64)
!293 = !DIDerivedType(tag: DW_TAG_typedef, name: "XMotionEvent", file: !200, line: 619, baseType: !294)
!294 = !DICompositeType(tag: DW_TAG_structure_type, file: !200, line: 605, size: 768, align: 64, elements: !295)
!295 = !{!296, !297, !298, !299, !300, !301, !302, !303, !304, !305, !306, !307, !308, !309, !310}
!296 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !294, file: !200, line: 606, baseType: !211, size: 32, align: 32)
!297 = !DIDerivedType(tag: DW_TAG_member, name: "serial", scope: !294, file: !200, line: 607, baseType: !197, size: 64, align: 64, offset: 64)
!298 = !DIDerivedType(tag: DW_TAG_member, name: "send_event", scope: !294, file: !200, line: 608, baseType: !211, size: 32, align: 32, offset: 128)
!299 = !DIDerivedType(tag: DW_TAG_member, name: "display", scope: !294, file: !200, line: 609, baseType: !248, size: 64, align: 64, offset: 192)
!300 = !DIDerivedType(tag: DW_TAG_member, name: "window", scope: !294, file: !200, line: 610, baseType: !252, size: 64, align: 64, offset: 256)
!301 = !DIDerivedType(tag: DW_TAG_member, name: "root", scope: !294, file: !200, line: 611, baseType: !252, size: 64, align: 64, offset: 320)
!302 = !DIDerivedType(tag: DW_TAG_member, name: "subwindow", scope: !294, file: !200, line: 612, baseType: !252, size: 64, align: 64, offset: 384)
!303 = !DIDerivedType(tag: DW_TAG_member, name: "time", scope: !294, file: !200, line: 613, baseType: !265, size: 64, align: 64, offset: 448)
!304 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !294, file: !200, line: 614, baseType: !211, size: 32, align: 32, offset: 512)
!305 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !294, file: !200, line: 614, baseType: !211, size: 32, align: 32, offset: 544)
!306 = !DIDerivedType(tag: DW_TAG_member, name: "x_root", scope: !294, file: !200, line: 615, baseType: !211, size: 32, align: 32, offset: 576)
!307 = !DIDerivedType(tag: DW_TAG_member, name: "y_root", scope: !294, file: !200, line: 615, baseType: !211, size: 32, align: 32, offset: 608)
!308 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !294, file: !200, line: 616, baseType: !156, size: 32, align: 32, offset: 640)
!309 = !DIDerivedType(tag: DW_TAG_member, name: "is_hint", scope: !294, file: !200, line: 617, baseType: !153, size: 8, align: 8, offset: 672)
!310 = !DIDerivedType(tag: DW_TAG_member, name: "same_screen", scope: !294, file: !200, line: 618, baseType: !211, size: 32, align: 32, offset: 704)
!311 = !DIDerivedType(tag: DW_TAG_member, name: "xcrossing", scope: !237, file: !200, line: 991, baseType: !312, size: 832, align: 64)
!312 = !DIDerivedType(tag: DW_TAG_typedef, name: "XCrossingEvent", file: !200, line: 642, baseType: !313)
!313 = !DICompositeType(tag: DW_TAG_structure_type, file: !200, line: 622, size: 832, align: 64, elements: !314)
!314 = !{!315, !316, !317, !318, !319, !320, !321, !322, !323, !324, !325, !326, !327, !328, !329, !330, !331}
!315 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !313, file: !200, line: 623, baseType: !211, size: 32, align: 32)
!316 = !DIDerivedType(tag: DW_TAG_member, name: "serial", scope: !313, file: !200, line: 624, baseType: !197, size: 64, align: 64, offset: 64)
!317 = !DIDerivedType(tag: DW_TAG_member, name: "send_event", scope: !313, file: !200, line: 625, baseType: !211, size: 32, align: 32, offset: 128)
!318 = !DIDerivedType(tag: DW_TAG_member, name: "display", scope: !313, file: !200, line: 626, baseType: !248, size: 64, align: 64, offset: 192)
!319 = !DIDerivedType(tag: DW_TAG_member, name: "window", scope: !313, file: !200, line: 627, baseType: !252, size: 64, align: 64, offset: 256)
!320 = !DIDerivedType(tag: DW_TAG_member, name: "root", scope: !313, file: !200, line: 628, baseType: !252, size: 64, align: 64, offset: 320)
!321 = !DIDerivedType(tag: DW_TAG_member, name: "subwindow", scope: !313, file: !200, line: 629, baseType: !252, size: 64, align: 64, offset: 384)
!322 = !DIDerivedType(tag: DW_TAG_member, name: "time", scope: !313, file: !200, line: 630, baseType: !265, size: 64, align: 64, offset: 448)
!323 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !313, file: !200, line: 631, baseType: !211, size: 32, align: 32, offset: 512)
!324 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !313, file: !200, line: 631, baseType: !211, size: 32, align: 32, offset: 544)
!325 = !DIDerivedType(tag: DW_TAG_member, name: "x_root", scope: !313, file: !200, line: 632, baseType: !211, size: 32, align: 32, offset: 576)
!326 = !DIDerivedType(tag: DW_TAG_member, name: "y_root", scope: !313, file: !200, line: 632, baseType: !211, size: 32, align: 32, offset: 608)
!327 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !313, file: !200, line: 633, baseType: !211, size: 32, align: 32, offset: 640)
!328 = !DIDerivedType(tag: DW_TAG_member, name: "detail", scope: !313, file: !200, line: 634, baseType: !211, size: 32, align: 32, offset: 672)
!329 = !DIDerivedType(tag: DW_TAG_member, name: "same_screen", scope: !313, file: !200, line: 639, baseType: !211, size: 32, align: 32, offset: 704)
!330 = !DIDerivedType(tag: DW_TAG_member, name: "focus", scope: !313, file: !200, line: 640, baseType: !211, size: 32, align: 32, offset: 736)
!331 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !313, file: !200, line: 641, baseType: !156, size: 32, align: 32, offset: 768)
!332 = !DIDerivedType(tag: DW_TAG_member, name: "xfocus", scope: !237, file: !200, line: 992, baseType: !333, size: 384, align: 64)
!333 = !DIDerivedType(tag: DW_TAG_typedef, name: "XFocusChangeEvent", file: !200, line: 660, baseType: !334)
!334 = !DICompositeType(tag: DW_TAG_structure_type, file: !200, line: 646, size: 384, align: 64, elements: !335)
!335 = !{!336, !337, !338, !339, !340, !341, !342}
!336 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !334, file: !200, line: 647, baseType: !211, size: 32, align: 32)
!337 = !DIDerivedType(tag: DW_TAG_member, name: "serial", scope: !334, file: !200, line: 648, baseType: !197, size: 64, align: 64, offset: 64)
!338 = !DIDerivedType(tag: DW_TAG_member, name: "send_event", scope: !334, file: !200, line: 649, baseType: !211, size: 32, align: 32, offset: 128)
!339 = !DIDerivedType(tag: DW_TAG_member, name: "display", scope: !334, file: !200, line: 650, baseType: !248, size: 64, align: 64, offset: 192)
!340 = !DIDerivedType(tag: DW_TAG_member, name: "window", scope: !334, file: !200, line: 651, baseType: !252, size: 64, align: 64, offset: 256)
!341 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !334, file: !200, line: 652, baseType: !211, size: 32, align: 32, offset: 320)
!342 = !DIDerivedType(tag: DW_TAG_member, name: "detail", scope: !334, file: !200, line: 654, baseType: !211, size: 32, align: 32, offset: 352)
!343 = !DIDerivedType(tag: DW_TAG_member, name: "xexpose", scope: !237, file: !200, line: 993, baseType: !344, size: 512, align: 64)
!344 = !DIDerivedType(tag: DW_TAG_typedef, name: "XExposeEvent", file: !200, line: 683, baseType: !345)
!345 = !DICompositeType(tag: DW_TAG_structure_type, file: !200, line: 674, size: 512, align: 64, elements: !346)
!346 = !{!347, !348, !349, !350, !351, !352, !353, !354, !355, !356}
!347 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !345, file: !200, line: 675, baseType: !211, size: 32, align: 32)
!348 = !DIDerivedType(tag: DW_TAG_member, name: "serial", scope: !345, file: !200, line: 676, baseType: !197, size: 64, align: 64, offset: 64)
!349 = !DIDerivedType(tag: DW_TAG_member, name: "send_event", scope: !345, file: !200, line: 677, baseType: !211, size: 32, align: 32, offset: 128)
!350 = !DIDerivedType(tag: DW_TAG_member, name: "display", scope: !345, file: !200, line: 678, baseType: !248, size: 64, align: 64, offset: 192)
!351 = !DIDerivedType(tag: DW_TAG_member, name: "window", scope: !345, file: !200, line: 679, baseType: !252, size: 64, align: 64, offset: 256)
!352 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !345, file: !200, line: 680, baseType: !211, size: 32, align: 32, offset: 320)
!353 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !345, file: !200, line: 680, baseType: !211, size: 32, align: 32, offset: 352)
!354 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !345, file: !200, line: 681, baseType: !211, size: 32, align: 32, offset: 384)
!355 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !345, file: !200, line: 681, baseType: !211, size: 32, align: 32, offset: 416)
!356 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !345, file: !200, line: 682, baseType: !211, size: 32, align: 32, offset: 448)
!357 = !DIDerivedType(tag: DW_TAG_member, name: "xgraphicsexpose", scope: !237, file: !200, line: 994, baseType: !358, size: 576, align: 64)
!358 = !DIDerivedType(tag: DW_TAG_typedef, name: "XGraphicsExposeEvent", file: !200, line: 696, baseType: !359)
!359 = !DICompositeType(tag: DW_TAG_structure_type, file: !200, line: 685, size: 576, align: 64, elements: !360)
!360 = !{!361, !362, !363, !364, !365, !367, !368, !369, !370, !371, !372, !373}
!361 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !359, file: !200, line: 686, baseType: !211, size: 32, align: 32)
!362 = !DIDerivedType(tag: DW_TAG_member, name: "serial", scope: !359, file: !200, line: 687, baseType: !197, size: 64, align: 64, offset: 64)
!363 = !DIDerivedType(tag: DW_TAG_member, name: "send_event", scope: !359, file: !200, line: 688, baseType: !211, size: 32, align: 32, offset: 128)
!364 = !DIDerivedType(tag: DW_TAG_member, name: "display", scope: !359, file: !200, line: 689, baseType: !248, size: 64, align: 64, offset: 192)
!365 = !DIDerivedType(tag: DW_TAG_member, name: "drawable", scope: !359, file: !200, line: 690, baseType: !366, size: 64, align: 64, offset: 256)
!366 = !DIDerivedType(tag: DW_TAG_typedef, name: "Drawable", file: !205, line: 97, baseType: !206)
!367 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !359, file: !200, line: 691, baseType: !211, size: 32, align: 32, offset: 320)
!368 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !359, file: !200, line: 691, baseType: !211, size: 32, align: 32, offset: 352)
!369 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !359, file: !200, line: 692, baseType: !211, size: 32, align: 32, offset: 384)
!370 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !359, file: !200, line: 692, baseType: !211, size: 32, align: 32, offset: 416)
!371 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !359, file: !200, line: 693, baseType: !211, size: 32, align: 32, offset: 448)
!372 = !DIDerivedType(tag: DW_TAG_member, name: "major_code", scope: !359, file: !200, line: 694, baseType: !211, size: 32, align: 32, offset: 480)
!373 = !DIDerivedType(tag: DW_TAG_member, name: "minor_code", scope: !359, file: !200, line: 695, baseType: !211, size: 32, align: 32, offset: 512)
!374 = !DIDerivedType(tag: DW_TAG_member, name: "xnoexpose", scope: !237, file: !200, line: 995, baseType: !375, size: 384, align: 64)
!375 = !DIDerivedType(tag: DW_TAG_typedef, name: "XNoExposeEvent", file: !200, line: 706, baseType: !376)
!376 = !DICompositeType(tag: DW_TAG_structure_type, file: !200, line: 698, size: 384, align: 64, elements: !377)
!377 = !{!378, !379, !380, !381, !382, !383, !384}
!378 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !376, file: !200, line: 699, baseType: !211, size: 32, align: 32)
!379 = !DIDerivedType(tag: DW_TAG_member, name: "serial", scope: !376, file: !200, line: 700, baseType: !197, size: 64, align: 64, offset: 64)
!380 = !DIDerivedType(tag: DW_TAG_member, name: "send_event", scope: !376, file: !200, line: 701, baseType: !211, size: 32, align: 32, offset: 128)
!381 = !DIDerivedType(tag: DW_TAG_member, name: "display", scope: !376, file: !200, line: 702, baseType: !248, size: 64, align: 64, offset: 192)
!382 = !DIDerivedType(tag: DW_TAG_member, name: "drawable", scope: !376, file: !200, line: 703, baseType: !366, size: 64, align: 64, offset: 256)
!383 = !DIDerivedType(tag: DW_TAG_member, name: "major_code", scope: !376, file: !200, line: 704, baseType: !211, size: 32, align: 32, offset: 320)
!384 = !DIDerivedType(tag: DW_TAG_member, name: "minor_code", scope: !376, file: !200, line: 705, baseType: !211, size: 32, align: 32, offset: 352)
!385 = !DIDerivedType(tag: DW_TAG_member, name: "xvisibility", scope: !237, file: !200, line: 996, baseType: !386, size: 384, align: 64)
!386 = !DIDerivedType(tag: DW_TAG_typedef, name: "XVisibilityEvent", file: !200, line: 715, baseType: !387)
!387 = !DICompositeType(tag: DW_TAG_structure_type, file: !200, line: 708, size: 384, align: 64, elements: !388)
!388 = !{!389, !390, !391, !392, !393, !394}
!389 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !387, file: !200, line: 709, baseType: !211, size: 32, align: 32)
!390 = !DIDerivedType(tag: DW_TAG_member, name: "serial", scope: !387, file: !200, line: 710, baseType: !197, size: 64, align: 64, offset: 64)
!391 = !DIDerivedType(tag: DW_TAG_member, name: "send_event", scope: !387, file: !200, line: 711, baseType: !211, size: 32, align: 32, offset: 128)
!392 = !DIDerivedType(tag: DW_TAG_member, name: "display", scope: !387, file: !200, line: 712, baseType: !248, size: 64, align: 64, offset: 192)
!393 = !DIDerivedType(tag: DW_TAG_member, name: "window", scope: !387, file: !200, line: 713, baseType: !252, size: 64, align: 64, offset: 256)
!394 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !387, file: !200, line: 714, baseType: !211, size: 32, align: 32, offset: 320)
!395 = !DIDerivedType(tag: DW_TAG_member, name: "xcreatewindow", scope: !237, file: !200, line: 997, baseType: !396, size: 576, align: 64)
!396 = !DIDerivedType(tag: DW_TAG_typedef, name: "XCreateWindowEvent", file: !200, line: 728, baseType: !397)
!397 = !DICompositeType(tag: DW_TAG_structure_type, file: !200, line: 717, size: 576, align: 64, elements: !398)
!398 = !{!399, !400, !401, !402, !403, !404, !405, !406, !407, !408, !409, !410}
!399 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !397, file: !200, line: 718, baseType: !211, size: 32, align: 32)
!400 = !DIDerivedType(tag: DW_TAG_member, name: "serial", scope: !397, file: !200, line: 719, baseType: !197, size: 64, align: 64, offset: 64)
!401 = !DIDerivedType(tag: DW_TAG_member, name: "send_event", scope: !397, file: !200, line: 720, baseType: !211, size: 32, align: 32, offset: 128)
!402 = !DIDerivedType(tag: DW_TAG_member, name: "display", scope: !397, file: !200, line: 721, baseType: !248, size: 64, align: 64, offset: 192)
!403 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !397, file: !200, line: 722, baseType: !252, size: 64, align: 64, offset: 256)
!404 = !DIDerivedType(tag: DW_TAG_member, name: "window", scope: !397, file: !200, line: 723, baseType: !252, size: 64, align: 64, offset: 320)
!405 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !397, file: !200, line: 724, baseType: !211, size: 32, align: 32, offset: 384)
!406 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !397, file: !200, line: 724, baseType: !211, size: 32, align: 32, offset: 416)
!407 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !397, file: !200, line: 725, baseType: !211, size: 32, align: 32, offset: 448)
!408 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !397, file: !200, line: 725, baseType: !211, size: 32, align: 32, offset: 480)
!409 = !DIDerivedType(tag: DW_TAG_member, name: "border_width", scope: !397, file: !200, line: 726, baseType: !211, size: 32, align: 32, offset: 512)
!410 = !DIDerivedType(tag: DW_TAG_member, name: "override_redirect", scope: !397, file: !200, line: 727, baseType: !211, size: 32, align: 32, offset: 544)
!411 = !DIDerivedType(tag: DW_TAG_member, name: "xdestroywindow", scope: !237, file: !200, line: 998, baseType: !412, size: 384, align: 64)
!412 = !DIDerivedType(tag: DW_TAG_typedef, name: "XDestroyWindowEvent", file: !200, line: 737, baseType: !413)
!413 = !DICompositeType(tag: DW_TAG_structure_type, file: !200, line: 730, size: 384, align: 64, elements: !414)
!414 = !{!415, !416, !417, !418, !419, !420}
!415 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !413, file: !200, line: 731, baseType: !211, size: 32, align: 32)
!416 = !DIDerivedType(tag: DW_TAG_member, name: "serial", scope: !413, file: !200, line: 732, baseType: !197, size: 64, align: 64, offset: 64)
!417 = !DIDerivedType(tag: DW_TAG_member, name: "send_event", scope: !413, file: !200, line: 733, baseType: !211, size: 32, align: 32, offset: 128)
!418 = !DIDerivedType(tag: DW_TAG_member, name: "display", scope: !413, file: !200, line: 734, baseType: !248, size: 64, align: 64, offset: 192)
!419 = !DIDerivedType(tag: DW_TAG_member, name: "event", scope: !413, file: !200, line: 735, baseType: !252, size: 64, align: 64, offset: 256)
!420 = !DIDerivedType(tag: DW_TAG_member, name: "window", scope: !413, file: !200, line: 736, baseType: !252, size: 64, align: 64, offset: 320)
!421 = !DIDerivedType(tag: DW_TAG_member, name: "xunmap", scope: !237, file: !200, line: 999, baseType: !422, size: 448, align: 64)
!422 = !DIDerivedType(tag: DW_TAG_typedef, name: "XUnmapEvent", file: !200, line: 747, baseType: !423)
!423 = !DICompositeType(tag: DW_TAG_structure_type, file: !200, line: 739, size: 448, align: 64, elements: !424)
!424 = !{!425, !426, !427, !428, !429, !430, !431}
!425 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !423, file: !200, line: 740, baseType: !211, size: 32, align: 32)
!426 = !DIDerivedType(tag: DW_TAG_member, name: "serial", scope: !423, file: !200, line: 741, baseType: !197, size: 64, align: 64, offset: 64)
!427 = !DIDerivedType(tag: DW_TAG_member, name: "send_event", scope: !423, file: !200, line: 742, baseType: !211, size: 32, align: 32, offset: 128)
!428 = !DIDerivedType(tag: DW_TAG_member, name: "display", scope: !423, file: !200, line: 743, baseType: !248, size: 64, align: 64, offset: 192)
!429 = !DIDerivedType(tag: DW_TAG_member, name: "event", scope: !423, file: !200, line: 744, baseType: !252, size: 64, align: 64, offset: 256)
!430 = !DIDerivedType(tag: DW_TAG_member, name: "window", scope: !423, file: !200, line: 745, baseType: !252, size: 64, align: 64, offset: 320)
!431 = !DIDerivedType(tag: DW_TAG_member, name: "from_configure", scope: !423, file: !200, line: 746, baseType: !211, size: 32, align: 32, offset: 384)
!432 = !DIDerivedType(tag: DW_TAG_member, name: "xmap", scope: !237, file: !200, line: 1000, baseType: !433, size: 448, align: 64)
!433 = !DIDerivedType(tag: DW_TAG_typedef, name: "XMapEvent", file: !200, line: 757, baseType: !434)
!434 = !DICompositeType(tag: DW_TAG_structure_type, file: !200, line: 749, size: 448, align: 64, elements: !435)
!435 = !{!436, !437, !438, !439, !440, !441, !442}
!436 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !434, file: !200, line: 750, baseType: !211, size: 32, align: 32)
!437 = !DIDerivedType(tag: DW_TAG_member, name: "serial", scope: !434, file: !200, line: 751, baseType: !197, size: 64, align: 64, offset: 64)
!438 = !DIDerivedType(tag: DW_TAG_member, name: "send_event", scope: !434, file: !200, line: 752, baseType: !211, size: 32, align: 32, offset: 128)
!439 = !DIDerivedType(tag: DW_TAG_member, name: "display", scope: !434, file: !200, line: 753, baseType: !248, size: 64, align: 64, offset: 192)
!440 = !DIDerivedType(tag: DW_TAG_member, name: "event", scope: !434, file: !200, line: 754, baseType: !252, size: 64, align: 64, offset: 256)
!441 = !DIDerivedType(tag: DW_TAG_member, name: "window", scope: !434, file: !200, line: 755, baseType: !252, size: 64, align: 64, offset: 320)
!442 = !DIDerivedType(tag: DW_TAG_member, name: "override_redirect", scope: !434, file: !200, line: 756, baseType: !211, size: 32, align: 32, offset: 384)
!443 = !DIDerivedType(tag: DW_TAG_member, name: "xmaprequest", scope: !237, file: !200, line: 1001, baseType: !444, size: 384, align: 64)
!444 = !DIDerivedType(tag: DW_TAG_typedef, name: "XMapRequestEvent", file: !200, line: 766, baseType: !445)
!445 = !DICompositeType(tag: DW_TAG_structure_type, file: !200, line: 759, size: 384, align: 64, elements: !446)
!446 = !{!447, !448, !449, !450, !451, !452}
!447 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !445, file: !200, line: 760, baseType: !211, size: 32, align: 32)
!448 = !DIDerivedType(tag: DW_TAG_member, name: "serial", scope: !445, file: !200, line: 761, baseType: !197, size: 64, align: 64, offset: 64)
!449 = !DIDerivedType(tag: DW_TAG_member, name: "send_event", scope: !445, file: !200, line: 762, baseType: !211, size: 32, align: 32, offset: 128)
!450 = !DIDerivedType(tag: DW_TAG_member, name: "display", scope: !445, file: !200, line: 763, baseType: !248, size: 64, align: 64, offset: 192)
!451 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !445, file: !200, line: 764, baseType: !252, size: 64, align: 64, offset: 256)
!452 = !DIDerivedType(tag: DW_TAG_member, name: "window", scope: !445, file: !200, line: 765, baseType: !252, size: 64, align: 64, offset: 320)
!453 = !DIDerivedType(tag: DW_TAG_member, name: "xreparent", scope: !237, file: !200, line: 1002, baseType: !454, size: 576, align: 64)
!454 = !DIDerivedType(tag: DW_TAG_typedef, name: "XReparentEvent", file: !200, line: 778, baseType: !455)
!455 = !DICompositeType(tag: DW_TAG_structure_type, file: !200, line: 768, size: 576, align: 64, elements: !456)
!456 = !{!457, !458, !459, !460, !461, !462, !463, !464, !465, !466}
!457 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !455, file: !200, line: 769, baseType: !211, size: 32, align: 32)
!458 = !DIDerivedType(tag: DW_TAG_member, name: "serial", scope: !455, file: !200, line: 770, baseType: !197, size: 64, align: 64, offset: 64)
!459 = !DIDerivedType(tag: DW_TAG_member, name: "send_event", scope: !455, file: !200, line: 771, baseType: !211, size: 32, align: 32, offset: 128)
!460 = !DIDerivedType(tag: DW_TAG_member, name: "display", scope: !455, file: !200, line: 772, baseType: !248, size: 64, align: 64, offset: 192)
!461 = !DIDerivedType(tag: DW_TAG_member, name: "event", scope: !455, file: !200, line: 773, baseType: !252, size: 64, align: 64, offset: 256)
!462 = !DIDerivedType(tag: DW_TAG_member, name: "window", scope: !455, file: !200, line: 774, baseType: !252, size: 64, align: 64, offset: 320)
!463 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !455, file: !200, line: 775, baseType: !252, size: 64, align: 64, offset: 384)
!464 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !455, file: !200, line: 776, baseType: !211, size: 32, align: 32, offset: 448)
!465 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !455, file: !200, line: 776, baseType: !211, size: 32, align: 32, offset: 480)
!466 = !DIDerivedType(tag: DW_TAG_member, name: "override_redirect", scope: !455, file: !200, line: 777, baseType: !211, size: 32, align: 32, offset: 512)
!467 = !DIDerivedType(tag: DW_TAG_member, name: "xconfigure", scope: !237, file: !200, line: 1003, baseType: !468, size: 704, align: 64)
!468 = !DIDerivedType(tag: DW_TAG_typedef, name: "XConfigureEvent", file: !200, line: 792, baseType: !469)
!469 = !DICompositeType(tag: DW_TAG_structure_type, file: !200, line: 780, size: 704, align: 64, elements: !470)
!470 = !{!471, !472, !473, !474, !475, !476, !477, !478, !479, !480, !481, !482, !483}
!471 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !469, file: !200, line: 781, baseType: !211, size: 32, align: 32)
!472 = !DIDerivedType(tag: DW_TAG_member, name: "serial", scope: !469, file: !200, line: 782, baseType: !197, size: 64, align: 64, offset: 64)
!473 = !DIDerivedType(tag: DW_TAG_member, name: "send_event", scope: !469, file: !200, line: 783, baseType: !211, size: 32, align: 32, offset: 128)
!474 = !DIDerivedType(tag: DW_TAG_member, name: "display", scope: !469, file: !200, line: 784, baseType: !248, size: 64, align: 64, offset: 192)
!475 = !DIDerivedType(tag: DW_TAG_member, name: "event", scope: !469, file: !200, line: 785, baseType: !252, size: 64, align: 64, offset: 256)
!476 = !DIDerivedType(tag: DW_TAG_member, name: "window", scope: !469, file: !200, line: 786, baseType: !252, size: 64, align: 64, offset: 320)
!477 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !469, file: !200, line: 787, baseType: !211, size: 32, align: 32, offset: 384)
!478 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !469, file: !200, line: 787, baseType: !211, size: 32, align: 32, offset: 416)
!479 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !469, file: !200, line: 788, baseType: !211, size: 32, align: 32, offset: 448)
!480 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !469, file: !200, line: 788, baseType: !211, size: 32, align: 32, offset: 480)
!481 = !DIDerivedType(tag: DW_TAG_member, name: "border_width", scope: !469, file: !200, line: 789, baseType: !211, size: 32, align: 32, offset: 512)
!482 = !DIDerivedType(tag: DW_TAG_member, name: "above", scope: !469, file: !200, line: 790, baseType: !252, size: 64, align: 64, offset: 576)
!483 = !DIDerivedType(tag: DW_TAG_member, name: "override_redirect", scope: !469, file: !200, line: 791, baseType: !211, size: 32, align: 32, offset: 640)
!484 = !DIDerivedType(tag: DW_TAG_member, name: "xgravity", scope: !237, file: !200, line: 1004, baseType: !485, size: 448, align: 64)
!485 = !DIDerivedType(tag: DW_TAG_typedef, name: "XGravityEvent", file: !200, line: 802, baseType: !486)
!486 = !DICompositeType(tag: DW_TAG_structure_type, file: !200, line: 794, size: 448, align: 64, elements: !487)
!487 = !{!488, !489, !490, !491, !492, !493, !494, !495}
!488 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !486, file: !200, line: 795, baseType: !211, size: 32, align: 32)
!489 = !DIDerivedType(tag: DW_TAG_member, name: "serial", scope: !486, file: !200, line: 796, baseType: !197, size: 64, align: 64, offset: 64)
!490 = !DIDerivedType(tag: DW_TAG_member, name: "send_event", scope: !486, file: !200, line: 797, baseType: !211, size: 32, align: 32, offset: 128)
!491 = !DIDerivedType(tag: DW_TAG_member, name: "display", scope: !486, file: !200, line: 798, baseType: !248, size: 64, align: 64, offset: 192)
!492 = !DIDerivedType(tag: DW_TAG_member, name: "event", scope: !486, file: !200, line: 799, baseType: !252, size: 64, align: 64, offset: 256)
!493 = !DIDerivedType(tag: DW_TAG_member, name: "window", scope: !486, file: !200, line: 800, baseType: !252, size: 64, align: 64, offset: 320)
!494 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !486, file: !200, line: 801, baseType: !211, size: 32, align: 32, offset: 384)
!495 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !486, file: !200, line: 801, baseType: !211, size: 32, align: 32, offset: 416)
!496 = !DIDerivedType(tag: DW_TAG_member, name: "xresizerequest", scope: !237, file: !200, line: 1005, baseType: !497, size: 384, align: 64)
!497 = !DIDerivedType(tag: DW_TAG_typedef, name: "XResizeRequestEvent", file: !200, line: 811, baseType: !498)
!498 = !DICompositeType(tag: DW_TAG_structure_type, file: !200, line: 804, size: 384, align: 64, elements: !499)
!499 = !{!500, !501, !502, !503, !504, !505, !506}
!500 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !498, file: !200, line: 805, baseType: !211, size: 32, align: 32)
!501 = !DIDerivedType(tag: DW_TAG_member, name: "serial", scope: !498, file: !200, line: 806, baseType: !197, size: 64, align: 64, offset: 64)
!502 = !DIDerivedType(tag: DW_TAG_member, name: "send_event", scope: !498, file: !200, line: 807, baseType: !211, size: 32, align: 32, offset: 128)
!503 = !DIDerivedType(tag: DW_TAG_member, name: "display", scope: !498, file: !200, line: 808, baseType: !248, size: 64, align: 64, offset: 192)
!504 = !DIDerivedType(tag: DW_TAG_member, name: "window", scope: !498, file: !200, line: 809, baseType: !252, size: 64, align: 64, offset: 256)
!505 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !498, file: !200, line: 810, baseType: !211, size: 32, align: 32, offset: 320)
!506 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !498, file: !200, line: 810, baseType: !211, size: 32, align: 32, offset: 352)
!507 = !DIDerivedType(tag: DW_TAG_member, name: "xconfigurerequest", scope: !237, file: !200, line: 1006, baseType: !508, size: 768, align: 64)
!508 = !DIDerivedType(tag: DW_TAG_typedef, name: "XConfigureRequestEvent", file: !200, line: 826, baseType: !509)
!509 = !DICompositeType(tag: DW_TAG_structure_type, file: !200, line: 813, size: 768, align: 64, elements: !510)
!510 = !{!511, !512, !513, !514, !515, !516, !517, !518, !519, !520, !521, !522, !523, !524}
!511 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !509, file: !200, line: 814, baseType: !211, size: 32, align: 32)
!512 = !DIDerivedType(tag: DW_TAG_member, name: "serial", scope: !509, file: !200, line: 815, baseType: !197, size: 64, align: 64, offset: 64)
!513 = !DIDerivedType(tag: DW_TAG_member, name: "send_event", scope: !509, file: !200, line: 816, baseType: !211, size: 32, align: 32, offset: 128)
!514 = !DIDerivedType(tag: DW_TAG_member, name: "display", scope: !509, file: !200, line: 817, baseType: !248, size: 64, align: 64, offset: 192)
!515 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !509, file: !200, line: 818, baseType: !252, size: 64, align: 64, offset: 256)
!516 = !DIDerivedType(tag: DW_TAG_member, name: "window", scope: !509, file: !200, line: 819, baseType: !252, size: 64, align: 64, offset: 320)
!517 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !509, file: !200, line: 820, baseType: !211, size: 32, align: 32, offset: 384)
!518 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !509, file: !200, line: 820, baseType: !211, size: 32, align: 32, offset: 416)
!519 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !509, file: !200, line: 821, baseType: !211, size: 32, align: 32, offset: 448)
!520 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !509, file: !200, line: 821, baseType: !211, size: 32, align: 32, offset: 480)
!521 = !DIDerivedType(tag: DW_TAG_member, name: "border_width", scope: !509, file: !200, line: 822, baseType: !211, size: 32, align: 32, offset: 512)
!522 = !DIDerivedType(tag: DW_TAG_member, name: "above", scope: !509, file: !200, line: 823, baseType: !252, size: 64, align: 64, offset: 576)
!523 = !DIDerivedType(tag: DW_TAG_member, name: "detail", scope: !509, file: !200, line: 824, baseType: !211, size: 32, align: 32, offset: 640)
!524 = !DIDerivedType(tag: DW_TAG_member, name: "value_mask", scope: !509, file: !200, line: 825, baseType: !197, size: 64, align: 64, offset: 704)
!525 = !DIDerivedType(tag: DW_TAG_member, name: "xcirculate", scope: !237, file: !200, line: 1007, baseType: !526, size: 448, align: 64)
!526 = !DIDerivedType(tag: DW_TAG_typedef, name: "XCirculateEvent", file: !200, line: 836, baseType: !527)
!527 = !DICompositeType(tag: DW_TAG_structure_type, file: !200, line: 828, size: 448, align: 64, elements: !528)
!528 = !{!529, !530, !531, !532, !533, !534, !535}
!529 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !527, file: !200, line: 829, baseType: !211, size: 32, align: 32)
!530 = !DIDerivedType(tag: DW_TAG_member, name: "serial", scope: !527, file: !200, line: 830, baseType: !197, size: 64, align: 64, offset: 64)
!531 = !DIDerivedType(tag: DW_TAG_member, name: "send_event", scope: !527, file: !200, line: 831, baseType: !211, size: 32, align: 32, offset: 128)
!532 = !DIDerivedType(tag: DW_TAG_member, name: "display", scope: !527, file: !200, line: 832, baseType: !248, size: 64, align: 64, offset: 192)
!533 = !DIDerivedType(tag: DW_TAG_member, name: "event", scope: !527, file: !200, line: 833, baseType: !252, size: 64, align: 64, offset: 256)
!534 = !DIDerivedType(tag: DW_TAG_member, name: "window", scope: !527, file: !200, line: 834, baseType: !252, size: 64, align: 64, offset: 320)
!535 = !DIDerivedType(tag: DW_TAG_member, name: "place", scope: !527, file: !200, line: 835, baseType: !211, size: 32, align: 32, offset: 384)
!536 = !DIDerivedType(tag: DW_TAG_member, name: "xcirculaterequest", scope: !237, file: !200, line: 1008, baseType: !537, size: 448, align: 64)
!537 = !DIDerivedType(tag: DW_TAG_typedef, name: "XCirculateRequestEvent", file: !200, line: 846, baseType: !538)
!538 = !DICompositeType(tag: DW_TAG_structure_type, file: !200, line: 838, size: 448, align: 64, elements: !539)
!539 = !{!540, !541, !542, !543, !544, !545, !546}
!540 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !538, file: !200, line: 839, baseType: !211, size: 32, align: 32)
!541 = !DIDerivedType(tag: DW_TAG_member, name: "serial", scope: !538, file: !200, line: 840, baseType: !197, size: 64, align: 64, offset: 64)
!542 = !DIDerivedType(tag: DW_TAG_member, name: "send_event", scope: !538, file: !200, line: 841, baseType: !211, size: 32, align: 32, offset: 128)
!543 = !DIDerivedType(tag: DW_TAG_member, name: "display", scope: !538, file: !200, line: 842, baseType: !248, size: 64, align: 64, offset: 192)
!544 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !538, file: !200, line: 843, baseType: !252, size: 64, align: 64, offset: 256)
!545 = !DIDerivedType(tag: DW_TAG_member, name: "window", scope: !538, file: !200, line: 844, baseType: !252, size: 64, align: 64, offset: 320)
!546 = !DIDerivedType(tag: DW_TAG_member, name: "place", scope: !538, file: !200, line: 845, baseType: !211, size: 32, align: 32, offset: 384)
!547 = !DIDerivedType(tag: DW_TAG_member, name: "xproperty", scope: !237, file: !200, line: 1009, baseType: !548, size: 512, align: 64)
!548 = !DIDerivedType(tag: DW_TAG_typedef, name: "XPropertyEvent", file: !200, line: 857, baseType: !549)
!549 = !DICompositeType(tag: DW_TAG_structure_type, file: !200, line: 848, size: 512, align: 64, elements: !550)
!550 = !{!551, !552, !553, !554, !555, !556, !558, !559}
!551 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !549, file: !200, line: 849, baseType: !211, size: 32, align: 32)
!552 = !DIDerivedType(tag: DW_TAG_member, name: "serial", scope: !549, file: !200, line: 850, baseType: !197, size: 64, align: 64, offset: 64)
!553 = !DIDerivedType(tag: DW_TAG_member, name: "send_event", scope: !549, file: !200, line: 851, baseType: !211, size: 32, align: 32, offset: 128)
!554 = !DIDerivedType(tag: DW_TAG_member, name: "display", scope: !549, file: !200, line: 852, baseType: !248, size: 64, align: 64, offset: 192)
!555 = !DIDerivedType(tag: DW_TAG_member, name: "window", scope: !549, file: !200, line: 853, baseType: !252, size: 64, align: 64, offset: 256)
!556 = !DIDerivedType(tag: DW_TAG_member, name: "atom", scope: !549, file: !200, line: 854, baseType: !557, size: 64, align: 64, offset: 320)
!557 = !DIDerivedType(tag: DW_TAG_typedef, name: "Atom", file: !205, line: 74, baseType: !197)
!558 = !DIDerivedType(tag: DW_TAG_member, name: "time", scope: !549, file: !200, line: 855, baseType: !265, size: 64, align: 64, offset: 384)
!559 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !549, file: !200, line: 856, baseType: !211, size: 32, align: 32, offset: 448)
!560 = !DIDerivedType(tag: DW_TAG_member, name: "xselectionclear", scope: !237, file: !200, line: 1010, baseType: !561, size: 448, align: 64)
!561 = !DIDerivedType(tag: DW_TAG_typedef, name: "XSelectionClearEvent", file: !200, line: 867, baseType: !562)
!562 = !DICompositeType(tag: DW_TAG_structure_type, file: !200, line: 859, size: 448, align: 64, elements: !563)
!563 = !{!564, !565, !566, !567, !568, !569, !570}
!564 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !562, file: !200, line: 860, baseType: !211, size: 32, align: 32)
!565 = !DIDerivedType(tag: DW_TAG_member, name: "serial", scope: !562, file: !200, line: 861, baseType: !197, size: 64, align: 64, offset: 64)
!566 = !DIDerivedType(tag: DW_TAG_member, name: "send_event", scope: !562, file: !200, line: 862, baseType: !211, size: 32, align: 32, offset: 128)
!567 = !DIDerivedType(tag: DW_TAG_member, name: "display", scope: !562, file: !200, line: 863, baseType: !248, size: 64, align: 64, offset: 192)
!568 = !DIDerivedType(tag: DW_TAG_member, name: "window", scope: !562, file: !200, line: 864, baseType: !252, size: 64, align: 64, offset: 256)
!569 = !DIDerivedType(tag: DW_TAG_member, name: "selection", scope: !562, file: !200, line: 865, baseType: !557, size: 64, align: 64, offset: 320)
!570 = !DIDerivedType(tag: DW_TAG_member, name: "time", scope: !562, file: !200, line: 866, baseType: !265, size: 64, align: 64, offset: 384)
!571 = !DIDerivedType(tag: DW_TAG_member, name: "xselectionrequest", scope: !237, file: !200, line: 1011, baseType: !572, size: 640, align: 64)
!572 = !DIDerivedType(tag: DW_TAG_typedef, name: "XSelectionRequestEvent", file: !200, line: 880, baseType: !573)
!573 = !DICompositeType(tag: DW_TAG_structure_type, file: !200, line: 869, size: 640, align: 64, elements: !574)
!574 = !{!575, !576, !577, !578, !579, !580, !581, !582, !583, !584}
!575 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !573, file: !200, line: 870, baseType: !211, size: 32, align: 32)
!576 = !DIDerivedType(tag: DW_TAG_member, name: "serial", scope: !573, file: !200, line: 871, baseType: !197, size: 64, align: 64, offset: 64)
!577 = !DIDerivedType(tag: DW_TAG_member, name: "send_event", scope: !573, file: !200, line: 872, baseType: !211, size: 32, align: 32, offset: 128)
!578 = !DIDerivedType(tag: DW_TAG_member, name: "display", scope: !573, file: !200, line: 873, baseType: !248, size: 64, align: 64, offset: 192)
!579 = !DIDerivedType(tag: DW_TAG_member, name: "owner", scope: !573, file: !200, line: 874, baseType: !252, size: 64, align: 64, offset: 256)
!580 = !DIDerivedType(tag: DW_TAG_member, name: "requestor", scope: !573, file: !200, line: 875, baseType: !252, size: 64, align: 64, offset: 320)
!581 = !DIDerivedType(tag: DW_TAG_member, name: "selection", scope: !573, file: !200, line: 876, baseType: !557, size: 64, align: 64, offset: 384)
!582 = !DIDerivedType(tag: DW_TAG_member, name: "target", scope: !573, file: !200, line: 877, baseType: !557, size: 64, align: 64, offset: 448)
!583 = !DIDerivedType(tag: DW_TAG_member, name: "property", scope: !573, file: !200, line: 878, baseType: !557, size: 64, align: 64, offset: 512)
!584 = !DIDerivedType(tag: DW_TAG_member, name: "time", scope: !573, file: !200, line: 879, baseType: !265, size: 64, align: 64, offset: 576)
!585 = !DIDerivedType(tag: DW_TAG_member, name: "xselection", scope: !237, file: !200, line: 1012, baseType: !586, size: 576, align: 64)
!586 = !DIDerivedType(tag: DW_TAG_typedef, name: "XSelectionEvent", file: !200, line: 892, baseType: !587)
!587 = !DICompositeType(tag: DW_TAG_structure_type, file: !200, line: 882, size: 576, align: 64, elements: !588)
!588 = !{!589, !590, !591, !592, !593, !594, !595, !596, !597}
!589 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !587, file: !200, line: 883, baseType: !211, size: 32, align: 32)
!590 = !DIDerivedType(tag: DW_TAG_member, name: "serial", scope: !587, file: !200, line: 884, baseType: !197, size: 64, align: 64, offset: 64)
!591 = !DIDerivedType(tag: DW_TAG_member, name: "send_event", scope: !587, file: !200, line: 885, baseType: !211, size: 32, align: 32, offset: 128)
!592 = !DIDerivedType(tag: DW_TAG_member, name: "display", scope: !587, file: !200, line: 886, baseType: !248, size: 64, align: 64, offset: 192)
!593 = !DIDerivedType(tag: DW_TAG_member, name: "requestor", scope: !587, file: !200, line: 887, baseType: !252, size: 64, align: 64, offset: 256)
!594 = !DIDerivedType(tag: DW_TAG_member, name: "selection", scope: !587, file: !200, line: 888, baseType: !557, size: 64, align: 64, offset: 320)
!595 = !DIDerivedType(tag: DW_TAG_member, name: "target", scope: !587, file: !200, line: 889, baseType: !557, size: 64, align: 64, offset: 384)
!596 = !DIDerivedType(tag: DW_TAG_member, name: "property", scope: !587, file: !200, line: 890, baseType: !557, size: 64, align: 64, offset: 448)
!597 = !DIDerivedType(tag: DW_TAG_member, name: "time", scope: !587, file: !200, line: 891, baseType: !265, size: 64, align: 64, offset: 512)
!598 = !DIDerivedType(tag: DW_TAG_member, name: "xcolormap", scope: !237, file: !200, line: 1013, baseType: !599, size: 448, align: 64)
!599 = !DIDerivedType(tag: DW_TAG_typedef, name: "XColormapEvent", file: !200, line: 907, baseType: !600)
!600 = !DICompositeType(tag: DW_TAG_structure_type, file: !200, line: 894, size: 448, align: 64, elements: !601)
!601 = !{!602, !603, !604, !605, !606, !607, !608, !609}
!602 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !600, file: !200, line: 895, baseType: !211, size: 32, align: 32)
!603 = !DIDerivedType(tag: DW_TAG_member, name: "serial", scope: !600, file: !200, line: 896, baseType: !197, size: 64, align: 64, offset: 64)
!604 = !DIDerivedType(tag: DW_TAG_member, name: "send_event", scope: !600, file: !200, line: 897, baseType: !211, size: 32, align: 32, offset: 128)
!605 = !DIDerivedType(tag: DW_TAG_member, name: "display", scope: !600, file: !200, line: 898, baseType: !248, size: 64, align: 64, offset: 192)
!606 = !DIDerivedType(tag: DW_TAG_member, name: "window", scope: !600, file: !200, line: 899, baseType: !252, size: 64, align: 64, offset: 256)
!607 = !DIDerivedType(tag: DW_TAG_member, name: "colormap", scope: !600, file: !200, line: 900, baseType: !221, size: 64, align: 64, offset: 320)
!608 = !DIDerivedType(tag: DW_TAG_member, name: "new", scope: !600, file: !200, line: 904, baseType: !211, size: 32, align: 32, offset: 384)
!609 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !600, file: !200, line: 906, baseType: !211, size: 32, align: 32, offset: 416)
!610 = !DIDerivedType(tag: DW_TAG_member, name: "xclient", scope: !237, file: !200, line: 1014, baseType: !611, size: 768, align: 64)
!611 = !DIDerivedType(tag: DW_TAG_typedef, name: "XClientMessageEvent", file: !200, line: 922, baseType: !612)
!612 = !DICompositeType(tag: DW_TAG_structure_type, file: !200, line: 909, size: 768, align: 64, elements: !613)
!613 = !{!614, !615, !616, !617, !618, !619, !620, !621}
!614 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !612, file: !200, line: 910, baseType: !211, size: 32, align: 32)
!615 = !DIDerivedType(tag: DW_TAG_member, name: "serial", scope: !612, file: !200, line: 911, baseType: !197, size: 64, align: 64, offset: 64)
!616 = !DIDerivedType(tag: DW_TAG_member, name: "send_event", scope: !612, file: !200, line: 912, baseType: !211, size: 32, align: 32, offset: 128)
!617 = !DIDerivedType(tag: DW_TAG_member, name: "display", scope: !612, file: !200, line: 913, baseType: !248, size: 64, align: 64, offset: 192)
!618 = !DIDerivedType(tag: DW_TAG_member, name: "window", scope: !612, file: !200, line: 914, baseType: !252, size: 64, align: 64, offset: 256)
!619 = !DIDerivedType(tag: DW_TAG_member, name: "message_type", scope: !612, file: !200, line: 915, baseType: !557, size: 64, align: 64, offset: 320)
!620 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !612, file: !200, line: 916, baseType: !211, size: 32, align: 32, offset: 384)
!621 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !612, file: !200, line: 921, baseType: !622, size: 320, align: 64, offset: 448)
!622 = !DICompositeType(tag: DW_TAG_union_type, scope: !612, file: !200, line: 917, size: 320, align: 64, elements: !623)
!623 = !{!624, !628, !633}
!624 = !DIDerivedType(tag: DW_TAG_member, name: "b", scope: !622, file: !200, line: 918, baseType: !625, size: 160, align: 8)
!625 = !DICompositeType(tag: DW_TAG_array_type, baseType: !153, size: 160, align: 8, elements: !626)
!626 = !{!627}
!627 = !DISubrange(count: 20)
!628 = !DIDerivedType(tag: DW_TAG_member, name: "s", scope: !622, file: !200, line: 919, baseType: !629, size: 160, align: 16)
!629 = !DICompositeType(tag: DW_TAG_array_type, baseType: !630, size: 160, align: 16, elements: !631)
!630 = !DIBasicType(name: "short", size: 16, align: 16, encoding: DW_ATE_signed)
!631 = !{!632}
!632 = !DISubrange(count: 10)
!633 = !DIDerivedType(tag: DW_TAG_member, name: "l", scope: !622, file: !200, line: 920, baseType: !634, size: 320, align: 64)
!634 = !DICompositeType(tag: DW_TAG_array_type, baseType: !183, size: 320, align: 64, elements: !635)
!635 = !{!636}
!636 = !DISubrange(count: 5)
!637 = !DIDerivedType(tag: DW_TAG_member, name: "xmapping", scope: !237, file: !200, line: 1015, baseType: !638, size: 448, align: 64)
!638 = !DIDerivedType(tag: DW_TAG_typedef, name: "XMappingEvent", file: !200, line: 934, baseType: !639)
!639 = !DICompositeType(tag: DW_TAG_structure_type, file: !200, line: 924, size: 448, align: 64, elements: !640)
!640 = !{!641, !642, !643, !644, !645, !646, !647, !648}
!641 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !639, file: !200, line: 925, baseType: !211, size: 32, align: 32)
!642 = !DIDerivedType(tag: DW_TAG_member, name: "serial", scope: !639, file: !200, line: 926, baseType: !197, size: 64, align: 64, offset: 64)
!643 = !DIDerivedType(tag: DW_TAG_member, name: "send_event", scope: !639, file: !200, line: 927, baseType: !211, size: 32, align: 32, offset: 128)
!644 = !DIDerivedType(tag: DW_TAG_member, name: "display", scope: !639, file: !200, line: 928, baseType: !248, size: 64, align: 64, offset: 192)
!645 = !DIDerivedType(tag: DW_TAG_member, name: "window", scope: !639, file: !200, line: 929, baseType: !252, size: 64, align: 64, offset: 256)
!646 = !DIDerivedType(tag: DW_TAG_member, name: "request", scope: !639, file: !200, line: 930, baseType: !211, size: 32, align: 32, offset: 320)
!647 = !DIDerivedType(tag: DW_TAG_member, name: "first_keycode", scope: !639, file: !200, line: 932, baseType: !211, size: 32, align: 32, offset: 352)
!648 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !639, file: !200, line: 933, baseType: !211, size: 32, align: 32, offset: 384)
!649 = !DIDerivedType(tag: DW_TAG_member, name: "xerror", scope: !237, file: !200, line: 1016, baseType: !650, size: 320, align: 64)
!650 = !DIDerivedType(tag: DW_TAG_typedef, name: "XErrorEvent", file: !200, line: 944, baseType: !651)
!651 = !DICompositeType(tag: DW_TAG_structure_type, file: !200, line: 936, size: 320, align: 64, elements: !652)
!652 = !{!653, !654, !655, !656, !657, !658, !659}
!653 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !651, file: !200, line: 937, baseType: !211, size: 32, align: 32)
!654 = !DIDerivedType(tag: DW_TAG_member, name: "display", scope: !651, file: !200, line: 938, baseType: !248, size: 64, align: 64, offset: 64)
!655 = !DIDerivedType(tag: DW_TAG_member, name: "resourceid", scope: !651, file: !200, line: 939, baseType: !206, size: 64, align: 64, offset: 128)
!656 = !DIDerivedType(tag: DW_TAG_member, name: "serial", scope: !651, file: !200, line: 940, baseType: !197, size: 64, align: 64, offset: 192)
!657 = !DIDerivedType(tag: DW_TAG_member, name: "error_code", scope: !651, file: !200, line: 941, baseType: !170, size: 8, align: 8, offset: 256)
!658 = !DIDerivedType(tag: DW_TAG_member, name: "request_code", scope: !651, file: !200, line: 942, baseType: !170, size: 8, align: 8, offset: 264)
!659 = !DIDerivedType(tag: DW_TAG_member, name: "minor_code", scope: !651, file: !200, line: 943, baseType: !170, size: 8, align: 8, offset: 272)
!660 = !DIDerivedType(tag: DW_TAG_member, name: "xkeymap", scope: !237, file: !200, line: 1017, baseType: !661, size: 576, align: 64)
!661 = !DIDerivedType(tag: DW_TAG_typedef, name: "XKeymapEvent", file: !200, line: 672, baseType: !662)
!662 = !DICompositeType(tag: DW_TAG_structure_type, file: !200, line: 665, size: 576, align: 64, elements: !663)
!663 = !{!664, !665, !666, !667, !668, !669}
!664 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !662, file: !200, line: 666, baseType: !211, size: 32, align: 32)
!665 = !DIDerivedType(tag: DW_TAG_member, name: "serial", scope: !662, file: !200, line: 667, baseType: !197, size: 64, align: 64, offset: 64)
!666 = !DIDerivedType(tag: DW_TAG_member, name: "send_event", scope: !662, file: !200, line: 668, baseType: !211, size: 32, align: 32, offset: 128)
!667 = !DIDerivedType(tag: DW_TAG_member, name: "display", scope: !662, file: !200, line: 669, baseType: !248, size: 64, align: 64, offset: 192)
!668 = !DIDerivedType(tag: DW_TAG_member, name: "window", scope: !662, file: !200, line: 670, baseType: !252, size: 64, align: 64, offset: 256)
!669 = !DIDerivedType(tag: DW_TAG_member, name: "key_vector", scope: !662, file: !200, line: 671, baseType: !670, size: 256, align: 8, offset: 320)
!670 = !DICompositeType(tag: DW_TAG_array_type, baseType: !153, size: 256, align: 8, elements: !671)
!671 = !{!672}
!672 = !DISubrange(count: 32)
!673 = !DIDerivedType(tag: DW_TAG_member, name: "xgeneric", scope: !237, file: !200, line: 1018, baseType: !674, size: 320, align: 64)
!674 = !DIDerivedType(tag: DW_TAG_typedef, name: "XGenericEvent", file: !200, line: 968, baseType: !675)
!675 = !DICompositeType(tag: DW_TAG_structure_type, file: !200, line: 960, size: 320, align: 64, elements: !676)
!676 = !{!677, !678, !679, !680, !681, !682}
!677 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !675, file: !200, line: 962, baseType: !211, size: 32, align: 32)
!678 = !DIDerivedType(tag: DW_TAG_member, name: "serial", scope: !675, file: !200, line: 963, baseType: !197, size: 64, align: 64, offset: 64)
!679 = !DIDerivedType(tag: DW_TAG_member, name: "send_event", scope: !675, file: !200, line: 964, baseType: !211, size: 32, align: 32, offset: 128)
!680 = !DIDerivedType(tag: DW_TAG_member, name: "display", scope: !675, file: !200, line: 965, baseType: !248, size: 64, align: 64, offset: 192)
!681 = !DIDerivedType(tag: DW_TAG_member, name: "extension", scope: !675, file: !200, line: 966, baseType: !211, size: 32, align: 32, offset: 256)
!682 = !DIDerivedType(tag: DW_TAG_member, name: "evtype", scope: !675, file: !200, line: 967, baseType: !211, size: 32, align: 32, offset: 288)
!683 = !DIDerivedType(tag: DW_TAG_member, name: "xcookie", scope: !237, file: !200, line: 1019, baseType: !684, size: 448, align: 64)
!684 = !DIDerivedType(tag: DW_TAG_typedef, name: "XGenericEventCookie", file: !200, line: 979, baseType: !685)
!685 = !DICompositeType(tag: DW_TAG_structure_type, file: !200, line: 970, size: 448, align: 64, elements: !686)
!686 = !{!687, !688, !689, !690, !691, !692, !693, !694}
!687 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !685, file: !200, line: 971, baseType: !211, size: 32, align: 32)
!688 = !DIDerivedType(tag: DW_TAG_member, name: "serial", scope: !685, file: !200, line: 972, baseType: !197, size: 64, align: 64, offset: 64)
!689 = !DIDerivedType(tag: DW_TAG_member, name: "send_event", scope: !685, file: !200, line: 973, baseType: !211, size: 32, align: 32, offset: 128)
!690 = !DIDerivedType(tag: DW_TAG_member, name: "display", scope: !685, file: !200, line: 974, baseType: !248, size: 64, align: 64, offset: 192)
!691 = !DIDerivedType(tag: DW_TAG_member, name: "extension", scope: !685, file: !200, line: 975, baseType: !211, size: 32, align: 32, offset: 256)
!692 = !DIDerivedType(tag: DW_TAG_member, name: "evtype", scope: !685, file: !200, line: 976, baseType: !211, size: 32, align: 32, offset: 288)
!693 = !DIDerivedType(tag: DW_TAG_member, name: "cookie", scope: !685, file: !200, line: 977, baseType: !156, size: 32, align: 32, offset: 320)
!694 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !685, file: !200, line: 978, baseType: !695, size: 64, align: 64, offset: 384)
!695 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!696 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !237, file: !200, line: 1020, baseType: !697, size: 1536, align: 64)
!697 = !DICompositeType(tag: DW_TAG_array_type, baseType: !183, size: 1536, align: 64, elements: !698)
!698 = !{!699}
!699 = !DISubrange(count: 24)
!700 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !151, size: 64, align: 64)
!701 = !DIDerivedType(tag: DW_TAG_member, name: "num_actions", scope: !147, file: !133, line: 136, baseType: !155, size: 32, align: 32, offset: 640)
!702 = !DIDerivedType(tag: DW_TAG_member, name: "resources", scope: !147, file: !133, line: 137, baseType: !703, size: 64, align: 64, offset: 704)
!703 = !DIDerivedType(tag: DW_TAG_typedef, name: "XtResourceList", file: !4, line: 368, baseType: !704)
!704 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !705, size: 64, align: 64)
!705 = !DICompositeType(tag: DW_TAG_structure_type, name: "_XtResource", file: !4, line: 360, size: 384, align: 64, elements: !706)
!706 = !{!707, !708, !709, !710, !711, !712, !713}
!707 = !DIDerivedType(tag: DW_TAG_member, name: "resource_name", scope: !705, file: !4, line: 361, baseType: !151, size: 64, align: 64)
!708 = !DIDerivedType(tag: DW_TAG_member, name: "resource_class", scope: !705, file: !4, line: 362, baseType: !151, size: 64, align: 64, offset: 64)
!709 = !DIDerivedType(tag: DW_TAG_member, name: "resource_type", scope: !705, file: !4, line: 363, baseType: !151, size: 64, align: 64, offset: 128)
!710 = !DIDerivedType(tag: DW_TAG_member, name: "resource_size", scope: !705, file: !4, line: 364, baseType: !155, size: 32, align: 32, offset: 192)
!711 = !DIDerivedType(tag: DW_TAG_member, name: "resource_offset", scope: !705, file: !4, line: 365, baseType: !155, size: 32, align: 32, offset: 224)
!712 = !DIDerivedType(tag: DW_TAG_member, name: "default_type", scope: !705, file: !4, line: 366, baseType: !151, size: 64, align: 64, offset: 256)
!713 = !DIDerivedType(tag: DW_TAG_member, name: "default_addr", scope: !705, file: !4, line: 367, baseType: !714, size: 64, align: 64, offset: 320)
!714 = !DIDerivedType(tag: DW_TAG_typedef, name: "XtPointer", file: !4, line: 164, baseType: !695)
!715 = !DIDerivedType(tag: DW_TAG_member, name: "num_resources", scope: !147, file: !133, line: 138, baseType: !155, size: 32, align: 32, offset: 768)
!716 = !DIDerivedType(tag: DW_TAG_member, name: "xrm_class", scope: !147, file: !133, line: 139, baseType: !717, size: 32, align: 32, offset: 800)
!717 = !DIDerivedType(tag: DW_TAG_typedef, name: "XrmClass", file: !718, line: 142, baseType: !719)
!718 = !DIFile(filename: "/usr/include/X11/Xresource.h", directory: "/home/dph/xpdf/motif-2.3.4/lib/Xm")
!719 = !DIDerivedType(tag: DW_TAG_typedef, name: "XrmQuark", file: !718, line: 84, baseType: !211)
!720 = !DIDerivedType(tag: DW_TAG_member, name: "compress_motion", scope: !147, file: !133, line: 140, baseType: !721, size: 8, align: 8, offset: 832)
!721 = !DIDerivedType(tag: DW_TAG_typedef, name: "Boolean", file: !4, line: 155, baseType: !153)
!722 = !DIDerivedType(tag: DW_TAG_member, name: "compress_exposure", scope: !147, file: !133, line: 141, baseType: !169, size: 8, align: 8, offset: 840)
!723 = !DIDerivedType(tag: DW_TAG_member, name: "compress_enterleave", scope: !147, file: !133, line: 142, baseType: !721, size: 8, align: 8, offset: 848)
!724 = !DIDerivedType(tag: DW_TAG_member, name: "visible_interest", scope: !147, file: !133, line: 143, baseType: !721, size: 8, align: 8, offset: 856)
!725 = !DIDerivedType(tag: DW_TAG_member, name: "destroy", scope: !147, file: !133, line: 144, baseType: !726, size: 64, align: 64, offset: 896)
!726 = !DIDerivedType(tag: DW_TAG_typedef, name: "XtWidgetProc", file: !159, line: 85, baseType: !727)
!727 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !728, size: 64, align: 64)
!728 = !DISubroutineType(types: !729)
!729 = !{null, !130}
!730 = !DIDerivedType(tag: DW_TAG_member, name: "resize", scope: !147, file: !133, line: 145, baseType: !726, size: 64, align: 64, offset: 960)
!731 = !DIDerivedType(tag: DW_TAG_member, name: "expose", scope: !147, file: !133, line: 146, baseType: !732, size: 64, align: 64, offset: 1024)
!732 = !DIDerivedType(tag: DW_TAG_typedef, name: "XtExposeProc", file: !159, line: 128, baseType: !733)
!733 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !734, size: 64, align: 64)
!734 = !DISubroutineType(types: !735)
!735 = !{null, !130, !235, !736}
!736 = !DIDerivedType(tag: DW_TAG_typedef, name: "Region", file: !737, line: 273, baseType: !738)
!737 = !DIFile(filename: "/usr/include/X11/Xutil.h", directory: "/home/dph/xpdf/motif-2.3.4/lib/Xm")
!738 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !739, size: 64, align: 64)
!739 = !DICompositeType(tag: DW_TAG_structure_type, name: "_XRegion", file: !737, line: 273, flags: DIFlagFwdDecl)
!740 = !DIDerivedType(tag: DW_TAG_member, name: "set_values", scope: !147, file: !133, line: 147, baseType: !741, size: 64, align: 64, offset: 1088)
!741 = !DIDerivedType(tag: DW_TAG_typedef, name: "XtSetValuesFunc", file: !159, line: 107, baseType: !742)
!742 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !743, size: 64, align: 64)
!743 = !DISubroutineType(types: !744)
!744 = !{!721, !130, !130, !130, !176, !184}
!745 = !DIDerivedType(tag: DW_TAG_member, name: "set_values_hook", scope: !147, file: !133, line: 148, baseType: !746, size: 64, align: 64, offset: 1152)
!746 = !DIDerivedType(tag: DW_TAG_typedef, name: "XtArgsFunc", file: !159, line: 115, baseType: !747)
!747 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !748, size: 64, align: 64)
!748 = !DISubroutineType(types: !749)
!749 = !{!721, !130, !176, !184}
!750 = !DIDerivedType(tag: DW_TAG_member, name: "set_values_almost", scope: !147, file: !133, line: 149, baseType: !751, size: 64, align: 64, offset: 1216)
!751 = !DIDerivedType(tag: DW_TAG_typedef, name: "XtAlmostProc", file: !159, line: 121, baseType: !752)
!752 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !753, size: 64, align: 64)
!753 = !DISubroutineType(types: !754)
!754 = !{null, !130, !130, !755, !755}
!755 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !756, size: 64, align: 64)
!756 = !DIDerivedType(tag: DW_TAG_typedef, name: "XtWidgetGeometry", file: !4, line: 224, baseType: !757)
!757 = !DICompositeType(tag: DW_TAG_structure_type, file: !4, line: 218, size: 256, align: 64, elements: !758)
!758 = !{!759, !761, !763, !764, !767, !768, !769, !770}
!759 = !DIDerivedType(tag: DW_TAG_member, name: "request_mode", scope: !757, file: !4, line: 219, baseType: !760, size: 32, align: 32)
!760 = !DIDerivedType(tag: DW_TAG_typedef, name: "XtGeometryMask", file: !4, line: 120, baseType: !156)
!761 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !757, file: !4, line: 220, baseType: !762, size: 16, align: 16, offset: 32)
!762 = !DIDerivedType(tag: DW_TAG_typedef, name: "Position", file: !4, line: 162, baseType: !630)
!763 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !757, file: !4, line: 220, baseType: !762, size: 16, align: 16, offset: 48)
!764 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !757, file: !4, line: 221, baseType: !765, size: 16, align: 16, offset: 64)
!765 = !DIDerivedType(tag: DW_TAG_typedef, name: "Dimension", file: !4, line: 161, baseType: !766)
!766 = !DIBasicType(name: "unsigned short", size: 16, align: 16, encoding: DW_ATE_unsigned)
!767 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !757, file: !4, line: 221, baseType: !765, size: 16, align: 16, offset: 80)
!768 = !DIDerivedType(tag: DW_TAG_member, name: "border_width", scope: !757, file: !4, line: 221, baseType: !765, size: 16, align: 16, offset: 96)
!769 = !DIDerivedType(tag: DW_TAG_member, name: "sibling", scope: !757, file: !4, line: 222, baseType: !130, size: 64, align: 64, offset: 128)
!770 = !DIDerivedType(tag: DW_TAG_member, name: "stack_mode", scope: !757, file: !4, line: 223, baseType: !211, size: 32, align: 32, offset: 192)
!771 = !DIDerivedType(tag: DW_TAG_member, name: "get_values_hook", scope: !147, file: !133, line: 150, baseType: !186, size: 64, align: 64, offset: 1280)
!772 = !DIDerivedType(tag: DW_TAG_member, name: "accept_focus", scope: !147, file: !133, line: 151, baseType: !773, size: 64, align: 64, offset: 1344)
!773 = !DIDerivedType(tag: DW_TAG_typedef, name: "XtAcceptFocusProc", file: !159, line: 89, baseType: !774)
!774 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !775, size: 64, align: 64)
!775 = !DISubroutineType(types: !776)
!776 = !{!721, !130, !777}
!777 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !265, size: 64, align: 64)
!778 = !DIDerivedType(tag: DW_TAG_member, name: "version", scope: !147, file: !133, line: 152, baseType: !779, size: 64, align: 64, offset: 1408)
!779 = !DIDerivedType(tag: DW_TAG_typedef, name: "XtVersionType", file: !159, line: 68, baseType: !197)
!780 = !DIDerivedType(tag: DW_TAG_member, name: "callback_private", scope: !147, file: !133, line: 153, baseType: !714, size: 64, align: 64, offset: 1472)
!781 = !DIDerivedType(tag: DW_TAG_member, name: "tm_table", scope: !147, file: !133, line: 154, baseType: !151, size: 64, align: 64, offset: 1536)
!782 = !DIDerivedType(tag: DW_TAG_member, name: "query_geometry", scope: !147, file: !133, line: 155, baseType: !783, size: 64, align: 64, offset: 1600)
!783 = !DIDerivedType(tag: DW_TAG_typedef, name: "XtGeometryHandler", file: !159, line: 152, baseType: !784)
!784 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !785, size: 64, align: 64)
!785 = !DISubroutineType(types: !786)
!786 = !{!787, !130, !755, !755}
!787 = !DIDerivedType(tag: DW_TAG_typedef, name: "XtGeometryResult", file: !4, line: 351, baseType: !3)
!788 = !DIDerivedType(tag: DW_TAG_member, name: "display_accelerator", scope: !147, file: !133, line: 156, baseType: !789, size: 64, align: 64, offset: 1664)
!789 = !DIDerivedType(tag: DW_TAG_typedef, name: "XtStringProc", file: !159, line: 158, baseType: !790)
!790 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !791, size: 64, align: 64)
!791 = !DISubroutineType(types: !792)
!792 = !{null, !130, !151}
!793 = !DIDerivedType(tag: DW_TAG_member, name: "extension", scope: !147, file: !133, line: 157, baseType: !714, size: 64, align: 64, offset: 1728)
!794 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !137, file: !133, line: 75, baseType: !130, size: 64, align: 64, offset: 128)
!795 = !DIDerivedType(tag: DW_TAG_member, name: "xrm_name", scope: !137, file: !133, line: 76, baseType: !796, size: 32, align: 32, offset: 192)
!796 = !DIDerivedType(tag: DW_TAG_typedef, name: "XrmName", file: !718, line: 136, baseType: !719)
!797 = !DIDerivedType(tag: DW_TAG_member, name: "being_destroyed", scope: !137, file: !133, line: 77, baseType: !721, size: 8, align: 8, offset: 224)
!798 = !DIDerivedType(tag: DW_TAG_member, name: "destroy_callbacks", scope: !137, file: !133, line: 78, baseType: !799, size: 64, align: 64, offset: 256)
!799 = !DIDerivedType(tag: DW_TAG_typedef, name: "XtCallbackList", file: !4, line: 338, baseType: !800)
!800 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !801, size: 64, align: 64)
!801 = !DICompositeType(tag: DW_TAG_structure_type, name: "_XtCallbackRec", file: !4, line: 335, size: 128, align: 64, elements: !802)
!802 = !{!803, !808}
!803 = !DIDerivedType(tag: DW_TAG_member, name: "callback", scope: !801, file: !4, line: 336, baseType: !804, size: 64, align: 64)
!804 = !DIDerivedType(tag: DW_TAG_typedef, name: "XtCallbackProc", file: !4, line: 329, baseType: !805)
!805 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !806, size: 64, align: 64)
!806 = !DISubroutineType(types: !807)
!807 = !{null, !130, !714, !714}
!808 = !DIDerivedType(tag: DW_TAG_member, name: "closure", scope: !801, file: !4, line: 337, baseType: !714, size: 64, align: 64, offset: 64)
!809 = !DIDerivedType(tag: DW_TAG_member, name: "constraints", scope: !137, file: !133, line: 79, baseType: !714, size: 64, align: 64, offset: 320)
!810 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !137, file: !133, line: 80, baseType: !762, size: 16, align: 16, offset: 384)
!811 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !137, file: !133, line: 80, baseType: !762, size: 16, align: 16, offset: 400)
!812 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !137, file: !133, line: 81, baseType: !765, size: 16, align: 16, offset: 416)
!813 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !137, file: !133, line: 81, baseType: !765, size: 16, align: 16, offset: 432)
!814 = !DIDerivedType(tag: DW_TAG_member, name: "border_width", scope: !137, file: !133, line: 82, baseType: !765, size: 16, align: 16, offset: 448)
!815 = !DIDerivedType(tag: DW_TAG_member, name: "managed", scope: !137, file: !133, line: 83, baseType: !721, size: 8, align: 8, offset: 464)
!816 = !DIDerivedType(tag: DW_TAG_member, name: "sensitive", scope: !137, file: !133, line: 84, baseType: !721, size: 8, align: 8, offset: 472)
!817 = !DIDerivedType(tag: DW_TAG_member, name: "ancestor_sensitive", scope: !137, file: !133, line: 85, baseType: !721, size: 8, align: 8, offset: 480)
!818 = !DIDerivedType(tag: DW_TAG_member, name: "event_table", scope: !137, file: !133, line: 86, baseType: !819, size: 64, align: 64, offset: 512)
!819 = !DIDerivedType(tag: DW_TAG_typedef, name: "XtEventTable", file: !4, line: 112, baseType: !820)
!820 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !821, size: 64, align: 64)
!821 = !DICompositeType(tag: DW_TAG_structure_type, name: "_XtEventRec", file: !4, line: 112, flags: DIFlagFwdDecl)
!822 = !DIDerivedType(tag: DW_TAG_member, name: "tm", scope: !137, file: !133, line: 87, baseType: !823, size: 256, align: 64, offset: 576)
!823 = !DIDerivedType(tag: DW_TAG_typedef, name: "XtTMRec", file: !159, line: 194, baseType: !824)
!824 = !DICompositeType(tag: DW_TAG_structure_type, name: "_XtTMRec", file: !159, line: 189, size: 256, align: 64, elements: !825)
!825 = !{!826, !830, !833, !836}
!826 = !DIDerivedType(tag: DW_TAG_member, name: "translations", scope: !824, file: !159, line: 190, baseType: !827, size: 64, align: 64)
!827 = !DIDerivedType(tag: DW_TAG_typedef, name: "XtTranslations", file: !4, line: 176, baseType: !828)
!828 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !829, size: 64, align: 64)
!829 = !DICompositeType(tag: DW_TAG_structure_type, name: "_TranslationData", file: !4, line: 176, flags: DIFlagFwdDecl)
!830 = !DIDerivedType(tag: DW_TAG_member, name: "proc_table", scope: !824, file: !159, line: 191, baseType: !831, size: 64, align: 64, offset: 64)
!831 = !DIDerivedType(tag: DW_TAG_typedef, name: "XtBoundActions", file: !4, line: 187, baseType: !832)
!832 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !231, size: 64, align: 64)
!833 = !DIDerivedType(tag: DW_TAG_member, name: "current_state", scope: !824, file: !159, line: 192, baseType: !834, size: 64, align: 64, offset: 128)
!834 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !835, size: 64, align: 64)
!835 = !DICompositeType(tag: DW_TAG_structure_type, name: "_XtStateRec", file: !159, line: 187, flags: DIFlagFwdDecl)
!836 = !DIDerivedType(tag: DW_TAG_member, name: "lastEventTime", scope: !824, file: !159, line: 193, baseType: !197, size: 64, align: 64, offset: 192)
!837 = !DIDerivedType(tag: DW_TAG_member, name: "accelerators", scope: !137, file: !133, line: 88, baseType: !827, size: 64, align: 64, offset: 832)
!838 = !DIDerivedType(tag: DW_TAG_member, name: "border_pixel", scope: !137, file: !133, line: 89, baseType: !839, size: 64, align: 64, offset: 896)
!839 = !DIDerivedType(tag: DW_TAG_typedef, name: "Pixel", file: !4, line: 122, baseType: !197)
!840 = !DIDerivedType(tag: DW_TAG_member, name: "border_pixmap", scope: !137, file: !133, line: 90, baseType: !204, size: 64, align: 64, offset: 960)
!841 = !DIDerivedType(tag: DW_TAG_member, name: "popup_list", scope: !137, file: !133, line: 91, baseType: !842, size: 64, align: 64, offset: 1024)
!842 = !DIDerivedType(tag: DW_TAG_typedef, name: "WidgetList", file: !4, line: 108, baseType: !843)
!843 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !130, size: 64, align: 64)
!844 = !DIDerivedType(tag: DW_TAG_member, name: "num_popups", scope: !137, file: !133, line: 92, baseType: !155, size: 32, align: 32, offset: 1088)
!845 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !137, file: !133, line: 93, baseType: !151, size: 64, align: 64, offset: 1152)
!846 = !DIDerivedType(tag: DW_TAG_member, name: "screen", scope: !137, file: !133, line: 94, baseType: !847, size: 64, align: 64, offset: 1216)
!847 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !848, size: 64, align: 64)
!848 = !DIDerivedType(tag: DW_TAG_typedef, name: "Screen", file: !200, line: 287, baseType: !849)
!849 = !DICompositeType(tag: DW_TAG_structure_type, file: !200, line: 269, size: 1024, align: 64, elements: !850)
!850 = !{!851, !865, !867, !868, !869, !870, !871, !872, !873, !894, !895, !896, !900, !901, !902, !903, !904, !905, !906, !907}
!851 = !DIDerivedType(tag: DW_TAG_member, name: "ext_data", scope: !849, file: !200, line: 270, baseType: !852, size: 64, align: 64)
!852 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !853, size: 64, align: 64)
!853 = !DIDerivedType(tag: DW_TAG_typedef, name: "XExtData", file: !200, line: 167, baseType: !854)
!854 = !DICompositeType(tag: DW_TAG_structure_type, name: "_XExtData", file: !200, line: 160, size: 256, align: 64, elements: !855)
!855 = !{!856, !857, !859, !863}
!856 = !DIDerivedType(tag: DW_TAG_member, name: "number", scope: !854, file: !200, line: 161, baseType: !211, size: 32, align: 32)
!857 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !854, file: !200, line: 162, baseType: !858, size: 64, align: 64, offset: 64)
!858 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !854, size: 64, align: 64)
!859 = !DIDerivedType(tag: DW_TAG_member, name: "free_private", scope: !854, file: !200, line: 163, baseType: !860, size: 64, align: 64, offset: 128)
!860 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !861, size: 64, align: 64)
!861 = !DISubroutineType(types: !862)
!862 = !{!211, !858}
!863 = !DIDerivedType(tag: DW_TAG_member, name: "private_data", scope: !854, file: !200, line: 166, baseType: !864, size: 64, align: 64, offset: 192)
!864 = !DIDerivedType(tag: DW_TAG_typedef, name: "XPointer", file: !200, line: 92, baseType: !152)
!865 = !DIDerivedType(tag: DW_TAG_member, name: "display", scope: !849, file: !200, line: 271, baseType: !866, size: 64, align: 64, offset: 64)
!866 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !250, size: 64, align: 64)
!867 = !DIDerivedType(tag: DW_TAG_member, name: "root", scope: !849, file: !200, line: 272, baseType: !252, size: 64, align: 64, offset: 128)
!868 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !849, file: !200, line: 273, baseType: !211, size: 32, align: 32, offset: 192)
!869 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !849, file: !200, line: 273, baseType: !211, size: 32, align: 32, offset: 224)
!870 = !DIDerivedType(tag: DW_TAG_member, name: "mwidth", scope: !849, file: !200, line: 274, baseType: !211, size: 32, align: 32, offset: 256)
!871 = !DIDerivedType(tag: DW_TAG_member, name: "mheight", scope: !849, file: !200, line: 274, baseType: !211, size: 32, align: 32, offset: 288)
!872 = !DIDerivedType(tag: DW_TAG_member, name: "ndepths", scope: !849, file: !200, line: 275, baseType: !211, size: 32, align: 32, offset: 320)
!873 = !DIDerivedType(tag: DW_TAG_member, name: "depths", scope: !849, file: !200, line: 276, baseType: !874, size: 64, align: 64, offset: 384)
!874 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !875, size: 64, align: 64)
!875 = !DIDerivedType(tag: DW_TAG_typedef, name: "Depth", file: !200, line: 259, baseType: !876)
!876 = !DICompositeType(tag: DW_TAG_structure_type, file: !200, line: 255, size: 128, align: 64, elements: !877)
!877 = !{!878, !879, !880}
!878 = !DIDerivedType(tag: DW_TAG_member, name: "depth", scope: !876, file: !200, line: 256, baseType: !211, size: 32, align: 32)
!879 = !DIDerivedType(tag: DW_TAG_member, name: "nvisuals", scope: !876, file: !200, line: 257, baseType: !211, size: 32, align: 32, offset: 32)
!880 = !DIDerivedType(tag: DW_TAG_member, name: "visuals", scope: !876, file: !200, line: 258, baseType: !881, size: 64, align: 64, offset: 64)
!881 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !882, size: 64, align: 64)
!882 = !DIDerivedType(tag: DW_TAG_typedef, name: "Visual", file: !200, line: 250, baseType: !883)
!883 = !DICompositeType(tag: DW_TAG_structure_type, file: !200, line: 239, size: 448, align: 64, elements: !884)
!884 = !{!885, !886, !888, !889, !890, !891, !892, !893}
!885 = !DIDerivedType(tag: DW_TAG_member, name: "ext_data", scope: !883, file: !200, line: 240, baseType: !852, size: 64, align: 64)
!886 = !DIDerivedType(tag: DW_TAG_member, name: "visualid", scope: !883, file: !200, line: 241, baseType: !887, size: 64, align: 64, offset: 64)
!887 = !DIDerivedType(tag: DW_TAG_typedef, name: "VisualID", file: !205, line: 76, baseType: !197)
!888 = !DIDerivedType(tag: DW_TAG_member, name: "class", scope: !883, file: !200, line: 245, baseType: !211, size: 32, align: 32, offset: 128)
!889 = !DIDerivedType(tag: DW_TAG_member, name: "red_mask", scope: !883, file: !200, line: 247, baseType: !197, size: 64, align: 64, offset: 192)
!890 = !DIDerivedType(tag: DW_TAG_member, name: "green_mask", scope: !883, file: !200, line: 247, baseType: !197, size: 64, align: 64, offset: 256)
!891 = !DIDerivedType(tag: DW_TAG_member, name: "blue_mask", scope: !883, file: !200, line: 247, baseType: !197, size: 64, align: 64, offset: 320)
!892 = !DIDerivedType(tag: DW_TAG_member, name: "bits_per_rgb", scope: !883, file: !200, line: 248, baseType: !211, size: 32, align: 32, offset: 384)
!893 = !DIDerivedType(tag: DW_TAG_member, name: "map_entries", scope: !883, file: !200, line: 249, baseType: !211, size: 32, align: 32, offset: 416)
!894 = !DIDerivedType(tag: DW_TAG_member, name: "root_depth", scope: !849, file: !200, line: 277, baseType: !211, size: 32, align: 32, offset: 448)
!895 = !DIDerivedType(tag: DW_TAG_member, name: "root_visual", scope: !849, file: !200, line: 278, baseType: !881, size: 64, align: 64, offset: 512)
!896 = !DIDerivedType(tag: DW_TAG_member, name: "default_gc", scope: !849, file: !200, line: 279, baseType: !897, size: 64, align: 64, offset: 576)
!897 = !DIDerivedType(tag: DW_TAG_typedef, name: "GC", file: !200, line: 234, baseType: !898)
!898 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !899, size: 64, align: 64)
!899 = !DICompositeType(tag: DW_TAG_structure_type, name: "_XGC", file: !200, line: 226, flags: DIFlagFwdDecl)
!900 = !DIDerivedType(tag: DW_TAG_member, name: "cmap", scope: !849, file: !200, line: 280, baseType: !221, size: 64, align: 64, offset: 640)
!901 = !DIDerivedType(tag: DW_TAG_member, name: "white_pixel", scope: !849, file: !200, line: 281, baseType: !197, size: 64, align: 64, offset: 704)
!902 = !DIDerivedType(tag: DW_TAG_member, name: "black_pixel", scope: !849, file: !200, line: 282, baseType: !197, size: 64, align: 64, offset: 768)
!903 = !DIDerivedType(tag: DW_TAG_member, name: "max_maps", scope: !849, file: !200, line: 283, baseType: !211, size: 32, align: 32, offset: 832)
!904 = !DIDerivedType(tag: DW_TAG_member, name: "min_maps", scope: !849, file: !200, line: 283, baseType: !211, size: 32, align: 32, offset: 864)
!905 = !DIDerivedType(tag: DW_TAG_member, name: "backing_store", scope: !849, file: !200, line: 284, baseType: !211, size: 32, align: 32, offset: 896)
!906 = !DIDerivedType(tag: DW_TAG_member, name: "save_unders", scope: !849, file: !200, line: 285, baseType: !211, size: 32, align: 32, offset: 928)
!907 = !DIDerivedType(tag: DW_TAG_member, name: "root_input_mask", scope: !849, file: !200, line: 286, baseType: !183, size: 64, align: 64, offset: 960)
!908 = !DIDerivedType(tag: DW_TAG_member, name: "colormap", scope: !137, file: !133, line: 95, baseType: !221, size: 64, align: 64, offset: 1280)
!909 = !DIDerivedType(tag: DW_TAG_member, name: "window", scope: !137, file: !133, line: 96, baseType: !252, size: 64, align: 64, offset: 1344)
!910 = !DIDerivedType(tag: DW_TAG_member, name: "depth", scope: !137, file: !133, line: 97, baseType: !155, size: 32, align: 32, offset: 1408)
!911 = !DIDerivedType(tag: DW_TAG_member, name: "background_pixel", scope: !137, file: !133, line: 98, baseType: !839, size: 64, align: 64, offset: 1472)
